# RETURN

`RETURN`子句指定返回结果，包括返回点、边、路径、属性等。

## 基本用法

### 返回点

```
MATCH (n)
RETURN n LIMIT 2
```

返回结果
```JSON
[{"n":{"identity":0,"label":"Person","properties":{"birthyear":1910,"name":"Rachel Kempson"}}},{"n":{"identity":1,"label":"Person","properties":{"birthyear":1908,"name":"Michael Redgrave"}}}]
```

### 返回边

```
MATCH (n)-[e]->(m)
RETURN e LIMIT 2
```

返回结果

```JSON
[{"e":{"dst":2,"forward":false,"identity":0,"label":"HAS_CHILD","label_id":0,"src":0,"temporal_id":0}},{"e":{"dst":3,"forward":false,"identity":0,"label":"HAS_CHILD","label_id":0,"src":0,"temporal_id":0}}]
```

### 返回属性

```
MATCH (n:Person)
RETURN n.name LIMIT 2
```

返回结果

```JSON
[{"n.name":"Christopher Nolan"},{"n.name":"Corin Redgrave"}]
```

### 不常见字符串作为变量名

```
MATCH (`/uncommon variable`:Person)
RETURN `/uncommon variable`.name LIMIT 3
```

返回结果

```JSON
[{"`/uncommon variable`.name":"Christopher Nolan"},{"`/uncommon variable`.name":"Corin Redgrave"},{"`/uncommon variable`.name":"Dennis Quaid"}]
```

### 列别名

```
MATCH (n:Person)
RETURN n.name AS nname LIMIT 2
```

返回结果

```JSON
[{"nname":"Christopher Nolan"},{"nname":"Corin Redgrave"}]
```

### 可选属性

```
MATCH (n:Person)
RETURN n.age LIMIT 2
```

返回结果

```JSON
[{"n.age":null},{"n.age":null}]
```

### 其它表达式

```
MATCH (n:Person)
RETURN n.birthyear > 1970, "I'm a literal", 1 + 2, abs(-2)
LIMIT 2
```

返回结果

```JSON
[{"\"I'm a literal\"":"I'm a literal","1 + 2":3,"abs(-2)":2,"n.birthyear > 1970":false},{"\"I'm a literal\"":"I'm a literal","1 + 2":3,"abs(-2)":2,"n.birthyear > 1970":false}]
```

### 结果唯一性


```
MATCH (n)
RETURN DISTINCT label(n) AS label
```

返回结果

```JSON
[{"label":"Person"},{"label":"City"},{"label":"Film"}]
```
