# LIMIT

`LIMIT`限制结果行数。

## 基本用法

### 使用LIMIT

```
MATCH (n:Person)
RETURN n.name LIMIT 2;
```

返回结果
```JSON
[{"n.name":"Christopher Nolan"},{"n.name":"Corin Redgrave"}]
```
