# MATCH

The `MATCH` clause is the most basic clause in GQL, and almost all queries are expanded through `MATCH`.

The `MATCH` clause is used to specify the matching pattern to search in the graph, to match vertices or paths that meet certain conditions.

## Basic Usage

### Vertex basics

#### Get all vertices

```
MATCH (n)
RETURN n
```

#### Get all vertices with a label

```
MATCH (n:Person)
RETURN n
```

#### Vertex matching with property

```
MATCH (n:Person{name:'Michael Redgrave'})
RETURN n.birthyear
```

return
```JSON
[{"n.birthyear":1908}]
```

#### Vertex matching with filter


```
MATCH (n:Person WHERE n.birthyear > 1910)
RETURN n.name LIMIT 2
```

return
```JSON
[{"n.name":"Christopher Nolan"},{"n.name":"Corin Redgrave"}]
```

### Edge basics

#### Edge pointing right

```
MATCH (n:Person WHERE n.birthyear = 1970)-[e]->(m)
RETURN n.name, label(e), m.name
```

return
```JSON
[{"label(e)":"BORN_IN","m.name":"London","n.name":"Christopher Nolan"},{"label(e)":"DIRECTED","m.name":null,"n.name":"Christopher Nolan"}]
```

#### Edge pointing left

```
MATCH (n:Person WHERE n.birthyear = 1939)<-[e]-(m)
RETURN n.name, label(e), m.name
```

return
```JSON
[{"label(e)":"HAS_CHILD","m.name":"Rachel Kempson","n.name":"Corin Redgrave"},{"label(e)":"HAS_CHILD","m.name":"Michael Redgrave","n.name":"Corin Redgrave"}]
```

#### Edge matching with filter

```
MATCH (n:Person)-[e:BORN_IN WHERE e.weight > 20]->(m)
RETURN n.name, e.weight, m.name
```

return
```JSON
[{"e.weight":20.549999237060547,"m.name":"New York","n.name":"John Williams"},{"e.weight":20.6200008392334,"m.name":"New York","n.name":"Lindsay Lohan"}]
```

### Path matching

#### Variable length

```
MATCH (n:Person)-[e]->{2,3}(m:Person)
RETURN m.name LIMIT 2
```

return
```JSON
[{"m.name":"Liam Neeson"},{"m.name":"Natasha Richardson"}]
```
