# OPTIONAL MATCH

`OPTIONAL MATCH`匹配图模式，如果未命中，则返回`null`。

## 基本用法

### 查询命中

```
OPTIONAL MATCH (n:Person{name:'Michael Redgrave'})
RETURN n.birthyear
```

返回结果
```JSON
[{"n.birthyear":1908}]
```

### 查询未命中

```
OPTIONAL MATCH (n:Person{name:'Redgrave Michael'})
RETURN n.birthyear
```

返回结果

```JSON
[{"n.birthyear":null}]
```
