<!DOCTYPE html>
<html class="writer-html5" lang="en" >
<head>
    <meta charset="utf-8" />
    <meta http-equiv="X-UA-Compatible" content="IE=edge" />
    <meta name="viewport" content="width=device-width, initial-scale=1.0" />
      <link rel="shortcut icon" href="../../../../img/favicon.ico" />
    <title>TuGraph Cypher - TuGraph Documentation</title>
    <link rel="stylesheet" href="../../../../css/theme.css" />
    <link rel="stylesheet" href="../../../../css/theme_extra.css" />
        <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/highlight.js/10.5.0/styles/github.min.css" />
    
      <script>
        // Current page data
        var mkdocs_page_name = "TuGraph Cypher";
        var mkdocs_page_input_path = "en-US\\2.operating\\6.tools\\1.tugraph-cypher.md";
        var mkdocs_page_url = null;
      </script>
    
    <script src="../../../../js/jquery-3.6.0.min.js" defer></script>
    <!--[if lt IE 9]>
      <script src="../../../../js/html5shiv.min.js"></script>
    <![endif]-->
      <script src="https://cdnjs.cloudflare.com/ajax/libs/highlight.js/10.5.0/highlight.min.js"></script>
      <script>hljs.initHighlightingOnLoad();</script> 
</head>

<body class="wy-body-for-nav" role="document">

  <div class="wy-grid-for-nav">
    <nav data-toggle="wy-nav-shift" class="wy-nav-side stickynav">
    <div class="wy-side-scroll">
      <div class="wy-side-nav-search">
          <a href="../../../.." class="icon icon-home"> TuGraph Documentation
        </a><div role="search">
  <form id ="rtd-search-form" class="wy-form" action="../../../../search.html" method="get">
      <input type="text" name="q" placeholder="Search docs" title="Type search term here" />
  </form>
</div>
      </div>

      <div class="wy-menu wy-menu-vertical" data-spy="affix" role="navigation" aria-label="Navigation menu">
              <ul>
                <li class="toctree-l1"><a class="reference internal" href="../../../..">Home</a>
                </li>
              </ul>
              <p class="caption"><span class="caption-text">en-US</span></p>
              <ul class="current">
                  <li class="toctree-l1"><a class="reference internal" href="#">Guide</a>
    <ul>
                <li class="toctree-l2"><a class="reference internal" href="../../../1.guide/1.what-is-graph/">What is Graph</a>
                </li>
                <li class="toctree-l2"><a class="reference internal" href="../../../1.guide/2.what-is-GDBMS/">What is GDBMS</a>
                </li>
                <li class="toctree-l2"><a class="reference internal" href="../../../1.guide/3.quick-start/">Quick Start</a>
                </li>
    </ul>
                  </li>
                  <li class="toctree-l1 current"><a class="reference internal current" href="#">Operating</a>
    <ul class="current">
                <li class="toctree-l2"><a class="reference internal" href="../../1.introduce/">Introduction</a>
                </li>
                <li class="toctree-l2"><a class="reference internal" href="../../2.Install/">Install</a>
                </li>
                <li class="toctree-l2"><a class="reference internal" href="../../3.data-import/">Data Import</a>
                </li>
                <li class="toctree-l2"><a class="reference internal" href="../../4.server-config/">Server Config</a>
                </li>
                <li class="toctree-l2"><a class="reference internal" href="../../5.operation/">Operation</a>
                </li>
                <li class="toctree-l2"><a class="reference internal" href="../../7.ha-mode/">HA Mode</a>
                </li>
                <li class="toctree-l2"><a class="reference internal" href="../../8.manage-database/">Manage Database</a>
                </li>
                <li class="toctree-l2"><a class="reference internal" href="../../9.privilege/">Privilege</a>
                </li>
                <li class="toctree-l2 current"><a class="reference internal current" href="#">Tools</a>
    <ul class="current">
                <li class="toctree-l3 current"><a class="reference internal current" href="./">TuGraph Cypher</a>
    <ul class="current">
    <li class="toctree-l4"><a class="reference internal" href="#single-command-mode">Single command mode</a>
    </li>
    <li class="toctree-l4"><a class="reference internal" href="#interactive-mode">Interactive mode</a>
    </li>
    </ul>
                </li>
                <li class="toctree-l3"><a class="reference internal" href="../2.tugraph-browser/">TuGraph Browser</a>
                </li>
                <li class="toctree-l3"><a class="reference internal" href="../3.tugraph-datax/">TuGraph DataX</a>
                </li>
                <li class="toctree-l3"><a class="reference internal" href="../4.tugraph-explore/">TuGraph Explore</a>
                </li>
    </ul>
                </li>
    </ul>
                  </li>
                  <li class="toctree-l1"><a class="reference internal" href="#">Developer Document</a>
    <ul>
                <li class="toctree-l2"><a class="reference internal" href="../../../3.developer-document/1.restful-api/">RESTful API</a>
                </li>
                <li class="toctree-l2"><a class="reference internal" href="../../../3.developer-document/2.cypher/">Cypher</a>
                </li>
                <li class="toctree-l2"><a class="reference internal" href="../../../3.developer-document/3.procedure/">Procedure</a>
                </li>
                <li class="toctree-l2"><a class="reference internal" href="#">Graph Analytics Engine</a>
    <ul>
                <li class="toctree-l3"><a class="reference internal" href="../../../3.developer-document/4.graph_analytics_engine/1.tutorial/">Tutorial</a>
                </li>
                <li class="toctree-l3"><a class="reference internal" href="../../../3.developer-document/4.graph_analytics_engine/2.olap-base-api/">OLAP Base API</a>
                </li>
                <li class="toctree-l3"><a class="reference internal" href="../../../3.developer-document/4.graph_analytics_engine/3.olap-on-db-api/">OLAP on DB API</a>
                </li>
                <li class="toctree-l3"><a class="reference internal" href="../../../3.developer-document/4.graph_analytics_engine/4.olap-on-disk-api/">OLAP on Disk API</a>
                </li>
                <li class="toctree-l3"><a class="reference internal" href="../../../3.developer-document/4.graph_analytics_engine/5.algorithms/">Algorithms</a>
                </li>
                <li class="toctree-l3"><a class="reference internal" href="../../../3.developer-document/4.graph_analytics_engine/6.python-api/">Python API</a>
                </li>
    </ul>
                </li>
    </ul>
                  </li>
                  <li class="toctree-l1"><a class="reference internal" href="#">Client</a>
    <ul>
                <li class="toctree-l2"><a class="reference internal" href="../../../4.client/1.java-client/">Java Client</a>
                </li>
                <li class="toctree-l2"><a class="reference internal" href="../../../4.client/2.python-client/">Python Client</a>
                </li>
                <li class="toctree-l2"><a class="reference internal" href="../../../4.client/3.cpp-client/">CPP Client</a>
                </li>
    </ul>
                  </li>
                  <li class="toctree-l1"><a class="reference internal" href="#">Supplement</a>
    <ul>
                <li class="toctree-l2"><a class="reference internal" href="../../../5.supplement/changelog/">Changelog</a>
                </li>
    </ul>
                  </li>
                  <li class="toctree-l1"><a class="reference internal" href="#">Community</a>
    <ul>
                <li class="toctree-l2"><a class="reference internal" href="../../../6.community/1.contributing/">Contributing</a>
                </li>
                <li class="toctree-l2"><a class="reference internal" href="../../../6.community/2.membership/">Membership</a>
                </li>
                <li class="toctree-l2"><a class="reference internal" href="../../../6.community/3.roadmap/">Roadmap</a>
                </li>
                <li class="toctree-l2"><a class="reference internal" href="../../../6.community/4.individual_cla/">Individual CLA</a>
                </li>
                <li class="toctree-l2"><a class="reference internal" href="../../../6.community/5.corporate_cla/">Corporate CLA</a>
                </li>
    </ul>
                  </li>
              </ul>
              <p class="caption"><span class="caption-text">zh-CN</span></p>
              <ul>
                  <li class="toctree-l1"><a class="reference internal" href="#">指南</a>
    <ul>
                <li class="toctree-l2"><a class="reference internal" href="../../../../zh-CN/1.guide/1.what-is-graph/">什么是图</a>
                </li>
                <li class="toctree-l2"><a class="reference internal" href="../../../../zh-CN/1.guide/2.what-is-GDBMS/">什么是 GDBMS</a>
                </li>
                <li class="toctree-l2"><a class="reference internal" href="../../../../zh-CN/1.guide/3.quick-start/">快速入门</a>
                </li>
    </ul>
                  </li>
                  <li class="toctree-l1"><a class="reference internal" href="#">操作</a>
    <ul>
                <li class="toctree-l2"><a class="reference internal" href="../../../../zh-CN/2.operating/1.introduce/">介绍</a>
                </li>
                <li class="toctree-l2"><a class="reference internal" href="../../../../zh-CN/2.operating/2.Install/">安装</a>
                </li>
                <li class="toctree-l2"><a class="reference internal" href="../../../../zh-CN/2.operating/3.data-import/">数据导入</a>
                </li>
                <li class="toctree-l2"><a class="reference internal" href="../../../../zh-CN/2.operating/4.server-config/">服务器配置</a>
                </li>
                <li class="toctree-l2"><a class="reference internal" href="../../../../zh-CN/2.operating/5.operation/">运维</a>
                </li>
                <li class="toctree-l2"><a class="reference internal" href="../../../../zh-CN/2.operating/7.ha-mode/">高可用模式</a>
                </li>
                <li class="toctree-l2"><a class="reference internal" href="../../../../zh-CN/2.operating/8.manage-database/">管理数据库</a>
                </li>
                <li class="toctree-l2"><a class="reference internal" href="../../../../zh-CN/2.operating/9.privilege/">权限</a>
                </li>
                <li class="toctree-l2"><a class="reference internal" href="../../../../zh-CN/2.operating/10.resource-monitoring/">资源监控</a>
                </li>
                <li class="toctree-l2"><a class="reference internal" href="../../../../zh-CN/2.operating/11.integration-test/">集成测试</a>
                </li>
                <li class="toctree-l2"><a class="reference internal" href="#">工具</a>
    <ul>
                <li class="toctree-l3"><a class="reference internal" href="../../../../zh-CN/2.operating/6.tools/1.tugraph-cypher/">TuGraph Cypher</a>
                </li>
                <li class="toctree-l3"><a class="reference internal" href="../../../../zh-CN/2.operating/6.tools/2.tugraph-browser/">TuGraph Browser</a>
                </li>
                <li class="toctree-l3"><a class="reference internal" href="../../../../zh-CN/2.operating/6.tools/3.tugraph-datax/">TuGraph DataX</a>
                </li>
                <li class="toctree-l3"><a class="reference internal" href="../../../../zh-CN/2.operating/6.tools/4.tugraph-explore/">TuGraph Explore</a>
                </li>
    </ul>
                </li>
    </ul>
                  </li>
                  <li class="toctree-l1"><a class="reference internal" href="#">开发者文档</a>
    <ul>
                <li class="toctree-l2"><a class="reference internal" href="../../../../zh-CN/3.developer-document/1.restful-api/">RESTful API</a>
                </li>
                <li class="toctree-l2"><a class="reference internal" href="../../../../zh-CN/3.developer-document/2.cypher/">Cypher</a>
                </li>
                <li class="toctree-l2"><a class="reference internal" href="../../../../zh-CN/3.developer-document/3.procedure/">Procedure</a>
                </li>
                <li class="toctree-l2"><a class="reference internal" href="#">图分析引擎</a>
    <ul>
                <li class="toctree-l3"><a class="reference internal" href="../../../../zh-CN/3.developer-document/4.graph_analytics_engine/1.tutorial/">教程</a>
                </li>
                <li class="toctree-l3"><a class="reference internal" href="../../../../zh-CN/3.developer-document/4.graph_analytics_engine/2.olap-base-api/">OLAP 基本 API</a>
                </li>
                <li class="toctree-l3"><a class="reference internal" href="../../../../zh-CN/3.developer-document/4.graph_analytics_engine/3.olap-on-db-api/">OLAP 在数据库上的 API</a>
                </li>
                <li class="toctree-l3"><a class="reference internal" href="../../../../zh-CN/3.developer-document/4.graph_analytics_engine/4.olap-on-disk-api/">OLAP 在磁盘上的 API</a>
                </li>
                <li class="toctree-l3"><a class="reference internal" href="../../../../zh-CN/3.developer-document/4.graph_analytics_engine/5.algorithms/">算法</a>
                </li>
                <li class="toctree-l3"><a class="reference internal" href="../../../../zh-CN/3.developer-document/4.graph_analytics_engine/6.python-api/">Python API</a>
                </li>
    </ul>
                </li>
    </ul>
                  </li>
                  <li class="toctree-l1"><a class="reference internal" href="#">客户端</a>
    <ul>
                <li class="toctree-l2"><a class="reference internal" href="../../../../zh-CN/4.client/1.java-client/">Java 客户端</a>
                </li>
                <li class="toctree-l2"><a class="reference internal" href="../../../../zh-CN/4.client/2.python-client/">Python 客户端</a>
                </li>
                <li class="toctree-l2"><a class="reference internal" href="../../../../zh-CN/4.client/3.cpp-client/">CPP 客户端</a>
                </li>
                <li class="toctree-l2"><a class="reference internal" href="../../../../zh-CN/4.client/4.java-ogm/">Java OGM</a>
                </li>
    </ul>
                  </li>
                  <li class="toctree-l1"><a class="reference internal" href="#">补充</a>
    <ul>
                <li class="toctree-l2"><a class="reference internal" href="../../../../zh-CN/5.supplement/changelog/">更新日志</a>
                </li>
    </ul>
                  </li>
                  <li class="toctree-l1"><a class="reference internal" href="#">社区</a>
    <ul>
                <li class="toctree-l2"><a class="reference internal" href="../../../../zh-CN/6.community/1.contributing/">参与贡献</a>
                </li>
                <li class="toctree-l2"><a class="reference internal" href="../../../../zh-CN/6.community/2.membership/">成员资格</a>
                </li>
                <li class="toctree-l2"><a class="reference internal" href="../../../../zh-CN/6.community/3.roadmap/">路线图</a>
                </li>
                <li class="toctree-l2"><a class="reference internal" href="../../../../zh-CN/6.community/4.individual_cla/">个人 CLA</a>
                </li>
                <li class="toctree-l2"><a class="reference internal" href="../../../../zh-CN/6.community/5.corporate_cla/">企业 CLA</a>
                </li>
    </ul>
                  </li>
              </ul>
      </div>
    </div>
    </nav>

    <section data-toggle="wy-nav-shift" class="wy-nav-content-wrap">
      <nav class="wy-nav-top" role="navigation" aria-label="Mobile navigation menu">
          <i data-toggle="wy-nav-top" class="fa fa-bars"></i>
          <a href="../../../..">TuGraph Documentation</a>
        
      </nav>
      <div class="wy-nav-content">
        <div class="rst-content"><div role="navigation" aria-label="breadcrumbs navigation">
  <ul class="wy-breadcrumbs">
    <li><a href="../../../.." class="icon icon-home" alt="Docs"></a> &raquo;</li>
          <li>en-US &raquo;</li>
          <li>Operating &raquo;</li>
          <li>Tools &raquo;</li>
      <li>TuGraph Cypher</li>
    <li class="wy-breadcrumbs-aside">
    </li>
  </ul>
  <hr/>
</div>
          <div role="main" class="document" itemscope="itemscope" itemtype="http://schema.org/Article">
            <div class="section" itemprop="articleBody">
              
                <h1 id="tugraph_cypher-instructions">tugraph_cypher Instructions</h1>
<blockquote>
<p>This document describes the use of the lgraph_cypher</p>
</blockquote>
<p>The TuGraph release comes with a query client named 'lgraph_cypher' that can be used to submit OpenCypher requests to the TuGraph server. The 'lgraph_cypher' client has two execution modes: single command mode and interactive mode.</p>
<h2 id="single-command-mode">Single command mode</h2>
<p>In single-command mode, 'lgraph_cypher' can be used to submit a single Cypher query and print the result directly to the terminal. The printed result can also be easily redirected to a specified file. This is handy when users need to get a lot of results from the server and save them in files.</p>
<p>In this mode, the 'lgraph_cypher' tool has the following options:</p>
<h3 id="command-line-parameters">Command line Parameters:</h3>
<table>
<thead>
<tr>
<th>Parameter</th>
<th>Type</th>
<th>Instructions</th>
</tr>
</thead>
<tbody>
<tr>
<td>--help</td>
<td>\</td>
<td>List all parameters and descriptions.</td>
</tr>
<tr>
<td>-example</td>
<td>\</td>
<td>List the command instances.</td>
</tr>
<tr>
<td>-c</td>
<td>string</td>
<td>A database configuration file used to obtain ip and port information.</td>
</tr>
<tr>
<td>-h</td>
<td>string</td>
<td>Database server IP address. Omit this parameter if you have a configuration file. The default value is' 127.0.0.1 '</td>
</tr>
<tr>
<td>-p</td>
<td>string</td>
<td>Database server port. Omit this parameter if you have a configuration file. The default value is 7071</td>
</tr>
<tr>
<td>-u</td>
<td>string</td>
<td>User name for logging in to the database.</td>
</tr>
<tr>
<td>-P</td>
<td>string</td>
<td>Password for logging in to the database.</td>
</tr>
<tr>
<td>-f</td>
<td>string</td>
<td>Contains the path to a single Cypher query single text file.</td>
</tr>
<tr>
<td>-s</td>
<td>string</td>
<td>Single-line cypher query command. Start and end with <code>"</code>.</td>
</tr>
<tr>
<td>-t</td>
<td>int</td>
<td>Specifies the server timeout threshold for cypher queries. The default value is 150 seconds.</td>
</tr>
<tr>
<td>-format</td>
<td>string</td>
<td>Query result display mode. Supports two formats: 'plain' and 'table'. The 'plain' format prints the query results in a single column. The 'table' format displays the query results in a tabular format. The default value is' table '</td>
</tr>
</tbody>
</table>
<h3 id="examples">Examples:</h3>
<p><strong>cypher command file query:</strong></p>
<pre><code class="language-powershell">
$ ./lgraph_cypher.py -c /home/usr/lgraph_standalone.json -u user -P password -f /home/usr/cypher.json

</code></pre>
<p><strong>cypher command single-sentence query:</strong></p>
<pre><code class="language-powershell">
$ ./lgraph_cypher.py -c /home/usr/lgraph_standalone.json -u user -P password -s &quot;MATCH (n) RETURN n&quot;

</code></pre>
<h2 id="interactive-mode">Interactive mode</h2>
<p>'lgraph_cypher' can also be run in interactive mode. In interactive mode, the client stays connected to the server and interacts with the user in read-evaluate-print-loop.</p>
<h3 id="enter-lgraph_cypher-interaction-mode">Enter lgraph_cypher interaction mode:</h3>
<p>If no '-f' or '-s' command line option added, 'lgraph_cypher' will enter interactive mode when running. how to use it:</p>
<pre><code>
$ ./lgraph_cypher.py -c /home/usr/lgraph_standalone.json -u admin -P 73@TuGraph

</code></pre>
<p>If the login is successful, the corresponding login success message will be displayed:</p>
<pre><code>**********************************************************************
*                  TuGraph Graph Database X.Y.Z                      *
*                                                                    *
*        Copyright(C) 2018 Ant Group. All rights reserved.           *
*                                                                    *
**********************************************************************
login success
----------------------------------
Host: 127.0.0.1
Port: 7071
Username: admin
----------------------------------
type &quot;:help&quot; to see all commands.
&gt;
</code></pre>
<p>Now we also provide an interactive shell for users to enter Cypher queries or use the ':help' command to check for available commands.</p>
<h3 id="command-description">Command Description</h3>
<p>In addition to the Cypher query, the shell of 'lgraph_cypher' accepts the following commands:</p>
<table>
<thead>
<tr>
<th>Command</th>
<th>Parameters</th>
<th>instructions</th>
</tr>
</thead>
<tbody>
<tr>
<td>:help</td>
<td>\</td>
<td>Displays the server information and the corresponding description of all commands.</td>
</tr>
<tr>
<td>:db_info</td>
<td>\</td>
<td>Query the current server status. /db/info for the corresponding REST API.</td>
</tr>
<tr>
<td>:clear</td>
<td>\</td>
<td>Clear the screen.</td>
</tr>
<tr>
<td>:use</td>
<td>{Graph Name}</td>
<td>The graph specified with this name defaults to <code>default</code></td>
</tr>
<tr>
<td>:source</td>
<td><code>-t {Query the timeout value} -f {The query file}</code></td>
<td>cypher command file query in interactive mode. The default timeout threshold is 150 seconds. Query file format reference No interactive query parameters.</td>
</tr>
<tr>
<td>:exit</td>
<td>\</td>
<td>Exit interactive mode and return to the original command line.</td>
</tr>
<tr>
<td>:format</td>
<td><code>plain</code> or <code>table</code></td>
<td>Change the display mode of cypher query results. Support 'plain' and 'table' modes.</td>
</tr>
<tr>
<td>:save all/command/result</td>
<td><code>-f {The file path}</code> <code>{Cypher}</code></td>
<td>The cypher command (command), query result (result) or both (all) are stored. The default location is' /saved_cypher.txt '</td>
</tr>
</tbody>
</table>
<p><strong>Note:</strong></p>
<ul>
<li>Each command should start with a colon <code>:</code>.</li>
</ul>
<p><strong>:save command example :</strong></p>
<pre><code>:save all -f /home/usr/saved.txt match (n) where return n, n.name limit 1000

</code></pre>
<h3 id="cypher-query-command">cypher query command:</h3>
<p>In interactive mode, users can also directly input a single sentence cypher command for query, with "'; ` "end. Enter commands that are case insensitive. Here's an example:</p>
<pre><code>login success
&gt;MATCH (n) RETURN n, n.name;
+---+---+-------------+
|   | n |n.name       |
+---+---+-------------+
| 0 | 0 |david        |
| 1 | 1 |Ann          |
| 2 | 2 |first movie  |
| 3 | 3 |Andres       |
+---+---+-------------+
time spent: 0.000520706176758
size of query: 4
&gt;
</code></pre>
<p><code>lgraph_cypher</code> supports multi-line input when typing commands. Users can use the <code>ENTER</code> key to type long query statements into multiple lines. In the case of multi-line input, the beginning of the command line will change from <code>&gt;</code> to <code>=&gt;</code>, and the user can continue to type the rest of the query.</p>
<p>Example:</p>
<pre><code>login success
&gt;MATCH (n)
=&gt;WHERE n.uid='M11'
=&gt;RETURN n, n.name;
</code></pre>
<h3 id="auxiliary-features">Auxiliary Features:</h3>
<p><strong>Input History:</strong> Press the up and down arrow keys in interactive mode to display the input history.</p>
<p><strong>Auto Completion:</strong> lgraph_cypher will automatically complete based on the input history. In the event of a completion prompt, pressing the right arrow key will automatically complete the command.</p>
              
            </div>
          </div><footer>
    <div class="rst-footer-buttons" role="navigation" aria-label="Footer Navigation">
        <a href="../../9.privilege/" class="btn btn-neutral float-left" title="Privilege"><span class="icon icon-circle-arrow-left"></span> Previous</a>
        <a href="../2.tugraph-browser/" class="btn btn-neutral float-right" title="TuGraph Browser">Next <span class="icon icon-circle-arrow-right"></span></a>
    </div>

  <hr/>

  <div role="contentinfo">
    <!-- Copyright etc -->
  </div>

  Built with <a href="https://www.mkdocs.org/">MkDocs</a> using a <a href="https://github.com/readthedocs/sphinx_rtd_theme">theme</a> provided by <a href="https://readthedocs.org">Read the Docs</a>.
</footer>
          
        </div>
      </div>

    </section>

  </div>

  <div class="rst-versions" role="note" aria-label="Versions">
  <span class="rst-current-version" data-toggle="rst-current-version">
    
    
      <span><a href="../../9.privilege/" style="color: #fcfcfc">&laquo; Previous</a></span>
    
    
      <span><a href="../2.tugraph-browser/" style="color: #fcfcfc">Next &raquo;</a></span>
    
  </span>
</div>
    <script>var base_url = '../../../..';</script>
    <script src="../../../../js/theme_extra.js" defer></script>
    <script src="../../../../js/theme.js" defer></script>
      <script src="../../../../search/main.js" defer></script>
    <script defer>
        window.onload = function () {
            SphinxRtdTheme.Navigation.enable(true);
        };
    </script>

</body>
</html>
