<!DOCTYPE html>
<html class="writer-html5" lang="en" >
<head>
    <meta charset="utf-8" />
    <meta http-equiv="X-UA-Compatible" content="IE=edge" />
    <meta name="viewport" content="width=device-width, initial-scale=1.0" />
      <link rel="shortcut icon" href="../../../../img/favicon.ico" />
    <title>TuGraph Cypher - TuGraph Documentation</title>
    <link rel="stylesheet" href="../../../../css/theme.css" />
    <link rel="stylesheet" href="../../../../css/theme_extra.css" />
        <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/highlight.js/10.5.0/styles/github.min.css" />
    
      <script>
        // Current page data
        var mkdocs_page_name = "TuGraph Cypher";
        var mkdocs_page_input_path = "zh-CN\\2.operating\\6.tools\\1.tugraph-cypher.md";
        var mkdocs_page_url = null;
      </script>
    
    <script src="../../../../js/jquery-3.6.0.min.js" defer></script>
    <!--[if lt IE 9]>
      <script src="../../../../js/html5shiv.min.js"></script>
    <![endif]-->
      <script src="https://cdnjs.cloudflare.com/ajax/libs/highlight.js/10.5.0/highlight.min.js"></script>
      <script>hljs.initHighlightingOnLoad();</script> 
</head>

<body class="wy-body-for-nav" role="document">

  <div class="wy-grid-for-nav">
    <nav data-toggle="wy-nav-shift" class="wy-nav-side stickynav">
    <div class="wy-side-scroll">
      <div class="wy-side-nav-search">
          <a href="../../../.." class="icon icon-home"> TuGraph Documentation
        </a><div role="search">
  <form id ="rtd-search-form" class="wy-form" action="../../../../search.html" method="get">
      <input type="text" name="q" placeholder="Search docs" title="Type search term here" />
  </form>
</div>
      </div>

      <div class="wy-menu wy-menu-vertical" data-spy="affix" role="navigation" aria-label="Navigation menu">
              <ul>
                <li class="toctree-l1"><a class="reference internal" href="../../../..">Home</a>
                </li>
              </ul>
              <p class="caption"><span class="caption-text">en-US</span></p>
              <ul>
                  <li class="toctree-l1"><a class="reference internal" href="#">Guide</a>
    <ul>
                <li class="toctree-l2"><a class="reference internal" href="../../../../en-US/1.guide/1.what-is-graph/">What is Graph</a>
                </li>
                <li class="toctree-l2"><a class="reference internal" href="../../../../en-US/1.guide/2.what-is-GDBMS/">What is GDBMS</a>
                </li>
                <li class="toctree-l2"><a class="reference internal" href="../../../../en-US/1.guide/3.quick-start/">Quick Start</a>
                </li>
    </ul>
                  </li>
                  <li class="toctree-l1"><a class="reference internal" href="#">Operating</a>
    <ul>
                <li class="toctree-l2"><a class="reference internal" href="../../../../en-US/2.operating/1.introduce/">Introduction</a>
                </li>
                <li class="toctree-l2"><a class="reference internal" href="../../../../en-US/2.operating/2.Install/">Install</a>
                </li>
                <li class="toctree-l2"><a class="reference internal" href="../../../../en-US/2.operating/3.data-import/">Data Import</a>
                </li>
                <li class="toctree-l2"><a class="reference internal" href="../../../../en-US/2.operating/4.server-config/">Server Config</a>
                </li>
                <li class="toctree-l2"><a class="reference internal" href="../../../../en-US/2.operating/5.operation/">Operation</a>
                </li>
                <li class="toctree-l2"><a class="reference internal" href="../../../../en-US/2.operating/7.ha-mode/">HA Mode</a>
                </li>
                <li class="toctree-l2"><a class="reference internal" href="../../../../en-US/2.operating/8.manage-database/">Manage Database</a>
                </li>
                <li class="toctree-l2"><a class="reference internal" href="../../../../en-US/2.operating/9.privilege/">Privilege</a>
                </li>
                <li class="toctree-l2"><a class="reference internal" href="#">Tools</a>
    <ul>
                <li class="toctree-l3"><a class="reference internal" href="../../../../en-US/2.operating/6.tools/1.tugraph-cypher/">TuGraph Cypher</a>
                </li>
                <li class="toctree-l3"><a class="reference internal" href="../../../../en-US/2.operating/6.tools/2.tugraph-browser/">TuGraph Browser</a>
                </li>
                <li class="toctree-l3"><a class="reference internal" href="../../../../en-US/2.operating/6.tools/3.tugraph-datax/">TuGraph DataX</a>
                </li>
                <li class="toctree-l3"><a class="reference internal" href="../../../../en-US/2.operating/6.tools/4.tugraph-explore/">TuGraph Explore</a>
                </li>
    </ul>
                </li>
    </ul>
                  </li>
                  <li class="toctree-l1"><a class="reference internal" href="#">Developer Document</a>
    <ul>
                <li class="toctree-l2"><a class="reference internal" href="../../../../en-US/3.developer-document/1.restful-api/">RESTful API</a>
                </li>
                <li class="toctree-l2"><a class="reference internal" href="../../../../en-US/3.developer-document/2.cypher/">Cypher</a>
                </li>
                <li class="toctree-l2"><a class="reference internal" href="../../../../en-US/3.developer-document/3.procedure/">Procedure</a>
                </li>
                <li class="toctree-l2"><a class="reference internal" href="#">Graph Analytics Engine</a>
    <ul>
                <li class="toctree-l3"><a class="reference internal" href="../../../../en-US/3.developer-document/4.graph_analytics_engine/1.tutorial/">Tutorial</a>
                </li>
                <li class="toctree-l3"><a class="reference internal" href="../../../../en-US/3.developer-document/4.graph_analytics_engine/2.olap-base-api/">OLAP Base API</a>
                </li>
                <li class="toctree-l3"><a class="reference internal" href="../../../../en-US/3.developer-document/4.graph_analytics_engine/3.olap-on-db-api/">OLAP on DB API</a>
                </li>
                <li class="toctree-l3"><a class="reference internal" href="../../../../en-US/3.developer-document/4.graph_analytics_engine/4.olap-on-disk-api/">OLAP on Disk API</a>
                </li>
                <li class="toctree-l3"><a class="reference internal" href="../../../../en-US/3.developer-document/4.graph_analytics_engine/5.algorithms/">Algorithms</a>
                </li>
                <li class="toctree-l3"><a class="reference internal" href="../../../../en-US/3.developer-document/4.graph_analytics_engine/6.python-api/">Python API</a>
                </li>
    </ul>
                </li>
    </ul>
                  </li>
                  <li class="toctree-l1"><a class="reference internal" href="#">Client</a>
    <ul>
                <li class="toctree-l2"><a class="reference internal" href="../../../../en-US/4.client/1.java-client/">Java Client</a>
                </li>
                <li class="toctree-l2"><a class="reference internal" href="../../../../en-US/4.client/2.python-client/">Python Client</a>
                </li>
                <li class="toctree-l2"><a class="reference internal" href="../../../../en-US/4.client/3.cpp-client/">CPP Client</a>
                </li>
    </ul>
                  </li>
                  <li class="toctree-l1"><a class="reference internal" href="#">Supplement</a>
    <ul>
                <li class="toctree-l2"><a class="reference internal" href="../../../../en-US/5.supplement/changelog/">Changelog</a>
                </li>
    </ul>
                  </li>
                  <li class="toctree-l1"><a class="reference internal" href="#">Community</a>
    <ul>
                <li class="toctree-l2"><a class="reference internal" href="../../../../en-US/6.community/1.contributing/">Contributing</a>
                </li>
                <li class="toctree-l2"><a class="reference internal" href="../../../../en-US/6.community/2.membership/">Membership</a>
                </li>
                <li class="toctree-l2"><a class="reference internal" href="../../../../en-US/6.community/3.roadmap/">Roadmap</a>
                </li>
                <li class="toctree-l2"><a class="reference internal" href="../../../../en-US/6.community/4.individual_cla/">Individual CLA</a>
                </li>
                <li class="toctree-l2"><a class="reference internal" href="../../../../en-US/6.community/5.corporate_cla/">Corporate CLA</a>
                </li>
    </ul>
                  </li>
              </ul>
              <p class="caption"><span class="caption-text">zh-CN</span></p>
              <ul class="current">
                  <li class="toctree-l1"><a class="reference internal" href="#">指南</a>
    <ul>
                <li class="toctree-l2"><a class="reference internal" href="../../../1.guide/1.what-is-graph/">什么是图</a>
                </li>
                <li class="toctree-l2"><a class="reference internal" href="../../../1.guide/2.what-is-GDBMS/">什么是 GDBMS</a>
                </li>
                <li class="toctree-l2"><a class="reference internal" href="../../../1.guide/3.quick-start/">快速入门</a>
                </li>
    </ul>
                  </li>
                  <li class="toctree-l1 current"><a class="reference internal current" href="#">操作</a>
    <ul class="current">
                <li class="toctree-l2"><a class="reference internal" href="../../1.introduce/">介绍</a>
                </li>
                <li class="toctree-l2"><a class="reference internal" href="../../2.Install/">安装</a>
                </li>
                <li class="toctree-l2"><a class="reference internal" href="../../3.data-import/">数据导入</a>
                </li>
                <li class="toctree-l2"><a class="reference internal" href="../../4.server-config/">服务器配置</a>
                </li>
                <li class="toctree-l2"><a class="reference internal" href="../../5.operation/">运维</a>
                </li>
                <li class="toctree-l2"><a class="reference internal" href="../../7.ha-mode/">高可用模式</a>
                </li>
                <li class="toctree-l2"><a class="reference internal" href="../../8.manage-database/">管理数据库</a>
                </li>
                <li class="toctree-l2"><a class="reference internal" href="../../9.privilege/">权限</a>
                </li>
                <li class="toctree-l2"><a class="reference internal" href="../../10.resource-monitoring/">资源监控</a>
                </li>
                <li class="toctree-l2"><a class="reference internal" href="../../11.integration-test/">集成测试</a>
                </li>
                <li class="toctree-l2 current"><a class="reference internal current" href="#">工具</a>
    <ul class="current">
                <li class="toctree-l3 current"><a class="reference internal current" href="./">TuGraph Cypher</a>
    <ul class="current">
    <li class="toctree-l4"><a class="reference internal" href="#_1">单命令模式</a>
    </li>
    <li class="toctree-l4"><a class="reference internal" href="#_4">交互模式</a>
    </li>
    </ul>
                </li>
                <li class="toctree-l3"><a class="reference internal" href="../2.tugraph-browser/">TuGraph Browser</a>
                </li>
                <li class="toctree-l3"><a class="reference internal" href="../3.tugraph-datax/">TuGraph DataX</a>
                </li>
                <li class="toctree-l3"><a class="reference internal" href="../4.tugraph-explore/">TuGraph Explore</a>
                </li>
    </ul>
                </li>
    </ul>
                  </li>
                  <li class="toctree-l1"><a class="reference internal" href="#">开发者文档</a>
    <ul>
                <li class="toctree-l2"><a class="reference internal" href="../../../3.developer-document/1.restful-api/">RESTful API</a>
                </li>
                <li class="toctree-l2"><a class="reference internal" href="../../../3.developer-document/2.cypher/">Cypher</a>
                </li>
                <li class="toctree-l2"><a class="reference internal" href="../../../3.developer-document/3.procedure/">Procedure</a>
                </li>
                <li class="toctree-l2"><a class="reference internal" href="#">图分析引擎</a>
    <ul>
                <li class="toctree-l3"><a class="reference internal" href="../../../3.developer-document/4.graph_analytics_engine/1.tutorial/">教程</a>
                </li>
                <li class="toctree-l3"><a class="reference internal" href="../../../3.developer-document/4.graph_analytics_engine/2.olap-base-api/">OLAP 基本 API</a>
                </li>
                <li class="toctree-l3"><a class="reference internal" href="../../../3.developer-document/4.graph_analytics_engine/3.olap-on-db-api/">OLAP 在数据库上的 API</a>
                </li>
                <li class="toctree-l3"><a class="reference internal" href="../../../3.developer-document/4.graph_analytics_engine/4.olap-on-disk-api/">OLAP 在磁盘上的 API</a>
                </li>
                <li class="toctree-l3"><a class="reference internal" href="../../../3.developer-document/4.graph_analytics_engine/5.algorithms/">算法</a>
                </li>
                <li class="toctree-l3"><a class="reference internal" href="../../../3.developer-document/4.graph_analytics_engine/6.python-api/">Python API</a>
                </li>
    </ul>
                </li>
    </ul>
                  </li>
                  <li class="toctree-l1"><a class="reference internal" href="#">客户端</a>
    <ul>
                <li class="toctree-l2"><a class="reference internal" href="../../../4.client/1.java-client/">Java 客户端</a>
                </li>
                <li class="toctree-l2"><a class="reference internal" href="../../../4.client/2.python-client/">Python 客户端</a>
                </li>
                <li class="toctree-l2"><a class="reference internal" href="../../../4.client/3.cpp-client/">CPP 客户端</a>
                </li>
                <li class="toctree-l2"><a class="reference internal" href="../../../4.client/4.java-ogm/">Java OGM</a>
                </li>
    </ul>
                  </li>
                  <li class="toctree-l1"><a class="reference internal" href="#">补充</a>
    <ul>
                <li class="toctree-l2"><a class="reference internal" href="../../../5.supplement/changelog/">更新日志</a>
                </li>
    </ul>
                  </li>
                  <li class="toctree-l1"><a class="reference internal" href="#">社区</a>
    <ul>
                <li class="toctree-l2"><a class="reference internal" href="../../../6.community/1.contributing/">参与贡献</a>
                </li>
                <li class="toctree-l2"><a class="reference internal" href="../../../6.community/2.membership/">成员资格</a>
                </li>
                <li class="toctree-l2"><a class="reference internal" href="../../../6.community/3.roadmap/">路线图</a>
                </li>
                <li class="toctree-l2"><a class="reference internal" href="../../../6.community/4.individual_cla/">个人 CLA</a>
                </li>
                <li class="toctree-l2"><a class="reference internal" href="../../../6.community/5.corporate_cla/">企业 CLA</a>
                </li>
    </ul>
                  </li>
              </ul>
      </div>
    </div>
    </nav>

    <section data-toggle="wy-nav-shift" class="wy-nav-content-wrap">
      <nav class="wy-nav-top" role="navigation" aria-label="Mobile navigation menu">
          <i data-toggle="wy-nav-top" class="fa fa-bars"></i>
          <a href="../../../..">TuGraph Documentation</a>
        
      </nav>
      <div class="wy-nav-content">
        <div class="rst-content"><div role="navigation" aria-label="breadcrumbs navigation">
  <ul class="wy-breadcrumbs">
    <li><a href="../../../.." class="icon icon-home" alt="Docs"></a> &raquo;</li>
          <li>zh-CN &raquo;</li>
          <li>操作 &raquo;</li>
          <li>工具 &raquo;</li>
      <li>TuGraph Cypher</li>
    <li class="wy-breadcrumbs-aside">
    </li>
  </ul>
  <hr/>
</div>
          <div role="main" class="document" itemscope="itemscope" itemtype="http://schema.org/Article">
            <div class="section" itemprop="articleBody">
              
                <h1 id="tugraph_cypher">tugraph_cypher 使用说明</h1>
<blockquote>
<p>此文档主要介绍 lgraph_cypher 文档的使用</p>
</blockquote>
<p>TuGraph 发布版本附带名为<code>lgraph_cypher</code>的查询客户端，可用于向 TuGraph 服务器提交 OpenCypher 请求。<code>lgraph_cypher</code>客户端有两种执行模式：单命令模式和交互式模式。</p>
<h2 id="_1">单命令模式</h2>
<p>在单命令模式下，<code>lgraph_cypher</code>可用于提交单个 Cypher 查询并将结果直接打印到终端，打印结果也可以容易地重定向写入指定文件。当用户需要从服务器获取大量结果并将其保存在文件中时，这非常便利。
在此模式下，<code>lgraph_cypher</code>工具具有以下选项：</p>
<h3 id="_2">命令行参数:</h3>
<p>| 参数     | 类型   | 说明                                                                     |
| -------- | ------ | ------------------------------------------------------------------------ | ------ | ----------------------------------------------------------------------------------------------------------------------------------------- |
| --help   | \     | 列出所有参数及说明。                                                     |
| -example | \     | 列出命令实例。                                                           |
| -c       | string | 数据库的配置文件，用于获取 ip 与 port 信息。                             |
| -h       | string | 数据库服务器 ip 地址，如有配置文件则可舍去此参数。默认值为<code>127.0.0.1</code> 。 |
| -p       | string | 数据库服务器端口，如有配置文件则可舍去此参数。默认值为<code>7071</code> 。          |
| -u       | string | 数据库登录用户名。                                                       |
| -P       | string | 数据库登录密码。                                                         |
| -f       | string | 包含单条 Cypher 查询单文本文件的路径。                                   |
| -s       | string | 单行 cypher 查询命令。以<code>"</code>开头结尾。                                    |
| -t       | int    | 进行 cypher 查询时服务器的超时阈值。默认值为<code>150</code>秒。 -format            | string | 查询结果显示模式。支持<code>plain</code>与<code>table</code>两种格式。<code>plain</code>格式会将查询结果单列打印。<code>table</code>格式会将查询结果以表格方式显示。默认值为<code>table</code>。 |</p>
<h3 id="_3">命令示例:</h3>
<p><strong>cypher 命令文件查询：</strong></p>
<pre><code class="language-powershell">$ ./lgraph_cypher.py -c /home/usr/lgraph_standalone.json -u user -P password -f /home/usr/cypher.json
</code></pre>
<p><strong>cypher 命令单句查询：</strong></p>
<pre><code class="language-powershell">$ ./lgraph_cypher.py -c /home/usr/lgraph_standalone.json -u user -P password -s &quot;MATCH (n) RETURN n&quot;
</code></pre>
<h2 id="_4">交互模式</h2>
<p><code>lgraph_cypher</code>也可以在交互模式下运行。在交互式模式下，客户端与服务器保持连接，并在读取-评估-打印-循环中与用户进行交互。</p>
<h3 id="lgraph_cypher">进入 lgraph_cypher 交互模式:</h3>
<p>如不加<code>-f</code>或<code>-s</code>命令行选项，运行<code>lgraph_cypher</code>时将会进入交互模式。使用方式如下：</p>
<pre><code>$ ./lgraph_cypher.py -c /home/usr/lgraph_standalone.json -u admin -P 73@TuGraph
</code></pre>
<p>如成功进入则会显示相应登录成功信息：</p>
<pre><code>**********************************************************************
*                  TuGraph Graph Database X.Y.Z                      *
*                                                                    *
*        Copyright(C) 2018 Ant Group. All rights reserved.           *
*                                                                    *
**********************************************************************
login success
----------------------------------
Host: 127.0.0.1
Port: 7071
Username: admin
----------------------------------
type &quot;:help&quot; to see all commands.
&gt;
</code></pre>
<p>现在我们也提供一个交互式 shell ，用于用户输入 Cypher 查询语句或使用<code>:help</code>命令来检查可用命令。</p>
<h3 id="command">command 种类与说明:</h3>
<p>除 Cypher 查询外，<code>lgraph_cypher</code> 的 shell 还接受以下命令：</p>
<table>
<thead>
<tr>
<th>命令</th>
<th>对应参数</th>
<th>说明</th>
</tr>
</thead>
<tbody>
<tr>
<td>:help</td>
<td>\</td>
<td>显示服务器信息与所有 command 对应说明。</td>
</tr>
<tr>
<td>:db_info</td>
<td>\</td>
<td>当前服务器状态查询。对应 REST API 的/db/info。</td>
</tr>
<tr>
<td>:clear</td>
<td>\</td>
<td>清空屏幕。</td>
</tr>
<tr>
<td>:use</td>
<td>{图的名称}</td>
<td>使用该名称指定的图，默认值为<code>default</code> 。</td>
</tr>
<tr>
<td>:source</td>
<td><code>-t {查询timeout值} -f {查询文件}</code></td>
<td>可交互模式下的 cypher 命令文件查询。超时阈值默认值为<code>150</code>秒。查询文件格式参考无交互式查询参数。</td>
</tr>
<tr>
<td>:exit</td>
<td>\</td>
<td>退出交互模式并返回原命令行。</td>
</tr>
<tr>
<td>:format</td>
<td><code>plain</code> or <code>table</code></td>
<td>更改 cypher 查询结果的显示模式。支持<code>plain</code>与<code>table</code>模式。</td>
</tr>
<tr>
<td>:save all/command/result</td>
<td><code>-f {文件路径}</code> <code>{cypher语句}</code></td>
<td>存储 cypher 命令（command）或查询结果（result）或以上二者（all）。默认存储位置为<code>/saved_cypher.txt</code></td>
</tr>
</tbody>
</table>
<p><strong>注意:</strong></p>
<ul>
<li>每条命令都应该以冒号开始 <code>:</code>.</li>
</ul>
<p><strong>:save 命令例子:</strong></p>
<pre><code>:save all -f /home/usr/saved.txt match (n) where return n, n.name limit 1000
</code></pre>
<h3 id="cypher">cypher 查询命令:</h3>
<p>在交互模式下，用户也可直接输入单句 cypher 命令进行查询，以"<code>;</code>"结束。输入命令不区分大小写。例子如下：</p>
<pre><code>login success
&gt;MATCH (n) RETURN n, n.name;
+---+---+-------------+
|   | n |n.name       |
+---+---+-------------+
| 0 | 0 |david        |
| 1 | 1 |Ann          |
| 2 | 2 |first movie  |
| 3 | 3 |Andres       |
+---+---+-------------+
time spent: 0.000520706176758
size of query: 4
&gt;
</code></pre>
<p><code>lgraph_cypher</code>输入命令时支持多行输入，用户可使用<code>ENTER</code>键将长查询语句分多行输入。多行输入情况下命令行开头会从<code>&gt;</code>变为<code>=&gt;</code>，然后用户可以继续输入查询的其余部分。</p>
<p>例子如下：</p>
<pre><code>login success
&gt;MATCH (n)
=&gt;WHERE n.uid='M11'
=&gt;RETURN n, n.name;
</code></pre>
<h3 id="_5">辅助功能:</h3>
<p><strong>历史查询：</strong> 在交互模式下按上下方向键可查询输入历史。</p>
<p><strong>自动补全：</strong> lgraph_cypher 会根据输入历史进行自动补全。在补全提示出现的情况下，按下右方向键就会自动补全命令。</p>
              
            </div>
          </div><footer>
    <div class="rst-footer-buttons" role="navigation" aria-label="Footer Navigation">
        <a href="../../11.integration-test/" class="btn btn-neutral float-left" title="集成测试"><span class="icon icon-circle-arrow-left"></span> Previous</a>
        <a href="../2.tugraph-browser/" class="btn btn-neutral float-right" title="TuGraph Browser">Next <span class="icon icon-circle-arrow-right"></span></a>
    </div>

  <hr/>

  <div role="contentinfo">
    <!-- Copyright etc -->
  </div>

  Built with <a href="https://www.mkdocs.org/">MkDocs</a> using a <a href="https://github.com/readthedocs/sphinx_rtd_theme">theme</a> provided by <a href="https://readthedocs.org">Read the Docs</a>.
</footer>
          
        </div>
      </div>

    </section>

  </div>

  <div class="rst-versions" role="note" aria-label="Versions">
  <span class="rst-current-version" data-toggle="rst-current-version">
    
    
      <span><a href="../../11.integration-test/" style="color: #fcfcfc">&laquo; Previous</a></span>
    
    
      <span><a href="../2.tugraph-browser/" style="color: #fcfcfc">Next &raquo;</a></span>
    
  </span>
</div>
    <script>var base_url = '../../../..';</script>
    <script src="../../../../js/theme_extra.js" defer></script>
    <script src="../../../../js/theme.js" defer></script>
      <script src="../../../../search/main.js" defer></script>
    <script defer>
        window.onload = function () {
            SphinxRtdTheme.Navigation.enable(true);
        };
    </script>

</body>
</html>
