# WHERE

`WHERE`子句用于过滤记录。

## 基本用法

### 过滤点

```
MATCH (n:Person WHERE n.birthyear > 1965)
RETURN n.name
```

返回结果

```JSON
[{"n.name":"Christopher Nolan"},{"n.name":"Lindsay Lohan"}]
```

### 过滤边

```
MATCH (n:Person WHERE n.birthyear > 1965)-[e:ACTED_IN]->(m:Film)
WHERE e.charactername = 'Halle/Annie'
RETURN m.title
```

返回结果

```JSON
[{"m.title":"The Parent Trap"}]
```

### 布尔表达式

`AND`, `OR`, `XOR`和 `NOT`布尔表达式可以用在 `WHERE`中用来过滤数据。

```
MATCH (n:Person)
WHERE
	n.birthyear > 1930 AND (n.birthyear < 1950 OR n.name = 'Corin Redgrave')
RETURN n LIMIT 2
```

返回结果

```JSON
[{"n":{"identity":3,"label":"Person","properties":{"birthyear":1939,"name":"Corin Redgrave"}}},{"n":{"identity":11,"label":"Person","properties":{"birthyear":1932,"name":"John Williams"}}}]
```
