# ORDER BY

`ORDER BY`是`RETURN`的子句，对输出的结果进行排序。

## 基本用法

### 对结果排序

```
MATCH (n:Person WHERE n.birthyear < 1970)
RETURN n.birthyear AS q
ORDER BY q ASC
LIMIT 5
```

返回结果
```JSON
[{"q":1873},{"q":1908},{"q":1910},{"q":1930},{"q":1932}]
```
