# SKIP

`SKIP`指定结果偏移行数。

## 基本用法

### 未使用SKIP

```
MATCH (n:Person)
RETURN n.name LIMIT 3
```

返回结果

```JSON
[{"n.name":"Christopher Nolan"},{"n.name":"Corin Redgrave"},{"n.name":"Dennis Quaid"}]
```

### 使用SKIP

```
MATCH (n:Person)
RETURN n.name SKIP 1 LIMIT 2
```

返回结果
```JSON
[{"n.name":"Corin Redgrave"},{"n.name":"Dennis Quaid"}]
```
