INSERT (:node5{@id:1101, p_long:1101, p_double:110.1, p_string:"A_1101"}), (:node5{@id:1102, p_long:1102, p_double:110.2, p_string:"B_1102"}), (:node5{@id:1103, p_long:1103, p_double:110.3, p_string:"C_1103"}), (:node5{@id:1104, p_long:1104, p_double:110.4, p_string:"D_1104"}), (:node5{@id:1105, p_long:1105, p_double:110.5, p_string:"E_1105"});

INSERT (:node5{@id:2101, p_long:2101, p_double:210.1, p_string:"A_2101"}), (:node5{@id:2102, p_long:2102, p_double:210.2, p_string:"B_2102"});

INSERT (:node5{@id:3101, p_long:3101, p_double:310.1, p_string:"A_3101"});

INSERT (:node5{@id:6101, p_long:6101, p_double:610.1, p_string:"A_6101"}), (:node5{@id:6102, p_long:6102, p_double:610.2, p_string:"B_6102"}), (:node5{@id:6103, p_long:6103, p_double:610.3, p_string:"C_6103"}), (:node5{@id:6104, p_long:6104, p_double:610.4, p_string:"D_6104"}), (:node5{@id:6105, p_long:6105, p_double:610.5, p_string:"E_6105"});

select n.@id, n.p_long, n.p_double, n.p_string match (n:node5 where @id in (1101,1102,1103,1104,1105,2101,2102,3101,6101,6102,6103,6104,6105)) order by n.@id;
+-------+----------+------------+------------+
| n.@id | n.p_long | n.p_double | n.p_string |
+-------+----------+------------+------------+
|  1101 |     1101 |      110.1 |     A_1101 |
|  1102 |     1102 |      110.2 |     B_1102 |
|  1103 |     1103 |      110.3 |     C_1103 |
|  1104 |     1104 |      110.4 |     D_1104 |
|  1105 |     1105 |      110.5 |     E_1105 |
|  2101 |     2101 |      210.1 |     A_2101 |
|  2102 |     2102 |      210.2 |     B_2102 |
|  3101 |     3101 |      310.1 |     A_3101 |
|  6101 |     6101 |      610.1 |     A_6101 |
|  6102 |     6102 |      610.2 |     B_6102 |
|  6103 |     6103 |      610.3 |     C_6103 |
|  6104 |     6104 |      610.4 |     D_6104 |
|  6105 |     6105 |      610.5 |     E_6105 |
+-------+----------+------------+------------+

INSERT ()-[:edge_n5_n5{p_long:1101, p_double:1101.2, p_string:"A-B", @src_id:1101, @dst_id:1102, @timestamp:0}]->(), ()-[:edge_n5_n5{p_long:1102, p_double:1102.3, p_string:"B-C", @src_id:1102, @dst_id:1103, @timestamp:0}]->(), ()-[:edge_n5_n5{p_long:1103, p_double:1103.4, p_string:"C-D", @src_id:1103, @dst_id:1104, @timestamp:0}]->(), ()-[:edge_n5_n5{p_long:1104, p_double:1104.5, p_string:"D-E", @src_id:1104, @dst_id:1105, @timestamp:0}]->(), ()-[:edge_n5_n5{p_long:1105, p_double:1105.3, p_string:"E-C", @src_id:1105, @dst_id:1103, @timestamp:0}]->();

select r1, r2, r3, r4, r5 match (a where @id = 1101)-[r1]->(b)-[r2]->(c)-[r3]->(d)-[r4]->(e)-[r5]->(x);
+--------------------------------+--------------------------------+--------------------------------+--------------------------------+--------------------------------+
|                             r1 |                             r2 |                             r3 |                             r4 |                             r5 |
+--------------------------------+--------------------------------+--------------------------------+--------------------------------+--------------------------------+
| (1101)-[:edge_n5_n5|0]->(1102) | (1102)-[:edge_n5_n5|0]->(1103) | (1103)-[:edge_n5_n5|0]->(1104) | (1104)-[:edge_n5_n5|0]->(1105) | (1105)-[:edge_n5_n5|0]->(1103) |
+--------------------------------+--------------------------------+--------------------------------+--------------------------------+--------------------------------+

INSERT ()-[:edge_n5_n5{p_long:2101, p_double:2101.2, p_string:"A-B", @src_id:2101, @dst_id:2102, @timestamp:0}]->(), ()-[:edge_n5_n5{p_long:2102, p_double:2102.1, p_string:"B-A", @src_id:2102, @dst_id:2101, @timestamp:0}]->();

select a, r, b match (a where @id in [2101, 2102])-[r]->(b);
+--------------+--------------------------------+--------------+
|            a |                              r |            b |
+--------------+--------------------------------+--------------+
| (2102:node5) | (2102)-[:edge_n5_n5|0]->(2101) | (2101:node5) |
| (2101:node5) | (2101)-[:edge_n5_n5|0]->(2102) | (2102:node5) |
+--------------+--------------------------------+--------------+

select a, r, b match (a where @id = 2101)-[r]-(b);
+--------------+--------------------------------+--------------+
|            a |                              r |            b |
+--------------+--------------------------------+--------------+
| (2101:node5) | (2101)-[:edge_n5_n5|0]->(2102) | (2102:node5) |
| (2101:node5) | (2101)<-[:edge_n5_n5|0]-(2102) | (2102:node5) |
+--------------+--------------------------------+--------------+

INSERT ()-[:edge_n5_n5{p_long:3101, p_double:3101.0, p_string:"A-A", @src_id:3101, @dst_id:3101, @timestamp:0}]->();

select a, r, b match (a where @id = 3101)-[r]->(b);
+--------------+--------------------------------+--------------+
|            a |                              r |            b |
+--------------+--------------------------------+--------------+
| (3101:node5) | (3101)-[:edge_n5_n5|0]->(3101) | (3101:node5) |
+--------------+--------------------------------+--------------+

INSERT ()-[:edge_n5_n5{p_long:6101, p_double:6101.2, p_string:"A-B", @src_id:6101, @dst_id:6102, @timestamp:0}]->(), ()-[:edge_n5_n5{p_long:6101, p_double:6101.3, p_string:"A-C", @src_id:6101, @dst_id:6103, @timestamp:0}]->(), ()-[:edge_n5_n5{p_long:6102, p_double:6102.4, p_string:"B-D", @src_id:6102, @dst_id:6104, @timestamp:0}]->(), ()-[:edge_n5_n5{p_long:6103, p_double:6103.4, p_string:"C-D", @src_id:6103, @dst_id:6104, @timestamp:0}]->(), ()-[:edge_n5_n5{p_long:6104, p_double:6104.5, p_string:"D-E", @src_id:6104, @dst_id:6105, @timestamp:0}]->();

select r1, r2, r3 match (a where @id = 6101)-[r1]->(b_or_c)-[r2]->(d)-[r3]->(e);
+--------------------------------+--------------------------------+--------------------------------+
|                             r1 |                             r2 |                             r3 |
+--------------------------------+--------------------------------+--------------------------------+
| (6101)-[:edge_n5_n5|0]->(6102) | (6102)-[:edge_n5_n5|0]->(6104) | (6104)-[:edge_n5_n5|0]->(6105) |
| (6101)-[:edge_n5_n5|0]->(6103) | (6103)-[:edge_n5_n5|0]->(6104) | (6104)-[:edge_n5_n5|0]->(6105) |
+--------------------------------+--------------------------------+--------------------------------+

MATCH (a where @id = 1101)-[r1]->(b)-[r2]->(c)-[r3]->(d)-[r4]->(e)
RETURN r1, r2, r3, r4, e.@id;
+--------------------------------+--------------------------------+--------------------------------+--------------------------------+-------+
|                             r1 |                             r2 |                             r3 |                             r4 | e.@id |
+--------------------------------+--------------------------------+--------------------------------+--------------------------------+-------+
| (1101)-[:edge_n5_n5|0]->(1102) | (1102)-[:edge_n5_n5|0]->(1103) | (1103)-[:edge_n5_n5|0]->(1104) | (1104)-[:edge_n5_n5|0]->(1105) |  1105 |
+--------------------------------+--------------------------------+--------------------------------+--------------------------------+-------+

match (a where @id = 1101)-[r1]->(b)-[r2]->(c)-[r3]->(d)-[r4]->(e)-[r5]->(xc)
RETURN r1, r2, r3, r4, r5, c.@id, xc.@id;
+--------------------------------+--------------------------------+--------------------------------+--------------------------------+--------------------------------+-------+--------+
|                             r1 |                             r2 |                             r3 |                             r4 |                             r5 | c.@id | xc.@id |
+--------------------------------+--------------------------------+--------------------------------+--------------------------------+--------------------------------+-------+--------+
| (1101)-[:edge_n5_n5|0]->(1102) | (1102)-[:edge_n5_n5|0]->(1103) | (1103)-[:edge_n5_n5|0]->(1104) | (1104)-[:edge_n5_n5|0]->(1105) | (1105)-[:edge_n5_n5|0]->(1103) |  1103 |   1103 |
+--------------------------------+--------------------------------+--------------------------------+--------------------------------+--------------------------------+-------+--------+

match (c where @id = 1103)-[r1]->(d)-[r2]->(e)-[r3]->(xc)<-[r4]-(b)
RETURN r1, r2, r3, r4, c.@id, xc.@id;
+--------------------------------+--------------------------------+--------------------------------+--------------------------------+-------+--------+
|                             r1 |                             r2 |                             r3 |                             r4 | c.@id | xc.@id |
+--------------------------------+--------------------------------+--------------------------------+--------------------------------+-------+--------+
| (1103)-[:edge_n5_n5|0]->(1104) | (1104)-[:edge_n5_n5|0]->(1105) | (1105)-[:edge_n5_n5|0]->(1103) | (1103)<-[:edge_n5_n5|0]-(1102) |  1103 |   1103 |
| (1103)-[:edge_n5_n5|0]->(1104) | (1104)-[:edge_n5_n5|0]->(1105) | (1105)-[:edge_n5_n5|0]->(1103) | (1103)<-[:edge_n5_n5|0]-(1105) |  1103 |   1103 |
+--------------------------------+--------------------------------+--------------------------------+--------------------------------+-------+--------+

match (c where @id = 1103)-[r1]->(d)-[r2]->(e)-[r3]->(xc)-[xr1]->(xd)
RETURN r1, r2, r3, xr1, c.@id, xc.@id, d.@id, xd.@id;
+--------------------------------+--------------------------------+--------------------------------+--------------------------------+-------+--------+-------+--------+
|                             r1 |                             r2 |                             r3 |                            xr1 | c.@id | xc.@id | d.@id | xd.@id |
+--------------------------------+--------------------------------+--------------------------------+--------------------------------+-------+--------+-------+--------+
| (1103)-[:edge_n5_n5|0]->(1104) | (1104)-[:edge_n5_n5|0]->(1105) | (1105)-[:edge_n5_n5|0]->(1103) | (1103)-[:edge_n5_n5|0]->(1104) |  1103 |   1103 |  1104 |   1104 |
+--------------------------------+--------------------------------+--------------------------------+--------------------------------+-------+--------+-------+--------+

match (c where @id = 1103)-[r1]->(d)-[r2]->(e)-[r3]->(xc)
RETURN r1, r2, r3, c.@id, xc.@id;
+--------------------------------+--------------------------------+--------------------------------+-------+--------+
|                             r1 |                             r2 |                             r3 | c.@id | xc.@id |
+--------------------------------+--------------------------------+--------------------------------+-------+--------+
| (1103)-[:edge_n5_n5|0]->(1104) | (1104)-[:edge_n5_n5|0]->(1105) | (1105)-[:edge_n5_n5|0]->(1103) |  1103 |   1103 |
+--------------------------------+--------------------------------+--------------------------------+-------+--------+

match (a where @id = 1101)-[r1]->(b)<-[xr1]-(xa)
RETURN r1, xr1, a.@id, xa.@id;
+--------------------------------+--------------------------------+-------+--------+
|                             r1 |                            xr1 | a.@id | xa.@id |
+--------------------------------+--------------------------------+-------+--------+
| (1101)-[:edge_n5_n5|0]->(1102) | (1102)<-[:edge_n5_n5|0]-(1101) |  1101 |   1101 |
+--------------------------------+--------------------------------+-------+--------+

match (a where @id = 1101)-[r1]-(b)-[r2_or_r1]-(c_or_a)
RETURN r1, r2_or_r1, a.@id, c_or_a.@id;
+--------------------------------+--------------------------------+-------+------------+
|                             r1 |                       r2_or_r1 | a.@id | c_or_a.@id |
+--------------------------------+--------------------------------+-------+------------+
| (1101)-[:edge_n5_n5|0]->(1102) | (1102)-[:edge_n5_n5|0]->(1103) |  1101 |       1103 |
| (1101)-[:edge_n5_n5|0]->(1102) | (1102)<-[:edge_n5_n5|0]-(1101) |  1101 |       1101 |
+--------------------------------+--------------------------------+-------+------------+

match (a where @id = 2101)-[r1]->(b)-[r2]->(xa)
RETURN a, r1, b, r2, xa;
+--------------+--------------------------------+--------------+--------------------------------+--------------+
|            a |                             r1 |            b |                             r2 |           xa |
+--------------+--------------------------------+--------------+--------------------------------+--------------+
| (2101:node5) | (2101)-[:edge_n5_n5|0]->(2102) | (2102:node5) | (2102)-[:edge_n5_n5|0]->(2101) | (2101:node5) |
+--------------+--------------------------------+--------------+--------------------------------+--------------+

match (d:node5 where p_long = 1104)-[r1]->(e)-[r2]->(c)-[r3]-(b_or_d)
RETURN d, r1, e, r2, c, r3, b_or_d;
+--------------+--------------------------------+--------------+--------------------------------+--------------+--------------------------------+--------------+
|            d |                             r1 |            e |                             r2 |            c |                             r3 |       b_or_d |
+--------------+--------------------------------+--------------+--------------------------------+--------------+--------------------------------+--------------+
| (1104:node5) | (1104)-[:edge_n5_n5|0]->(1105) | (1105:node5) | (1105)-[:edge_n5_n5|0]->(1103) | (1103:node5) | (1103)-[:edge_n5_n5|0]->(1104) | (1104:node5) |
| (1104:node5) | (1104)-[:edge_n5_n5|0]->(1105) | (1105:node5) | (1105)-[:edge_n5_n5|0]->(1103) | (1103:node5) | (1103)<-[:edge_n5_n5|0]-(1102) | (1102:node5) |
| (1104:node5) | (1104)-[:edge_n5_n5|0]->(1105) | (1105:node5) | (1105)-[:edge_n5_n5|0]->(1103) | (1103:node5) | (1103)<-[:edge_n5_n5|0]-(1105) | (1105:node5) |
+--------------+--------------------------------+--------------+--------------------------------+--------------+--------------------------------+--------------+

match p = (d where @id = 1104)-[r]->{0,3}(x)
RETURN r.p_string;
+---------------+
|    r.p_string |
+---------------+
|            [] |
|         [D-E] |
|     [D-E,E-C] |
| [D-E,E-C,C-D] |
+---------------+

match p = (b where @id = 1102)-[r]->{0,4}(x)
RETURN r.p_string;
+-------------------+
|        r.p_string |
+-------------------+
|                [] |
|             [B-C] |
|         [B-C,C-D] |
|     [B-C,C-D,D-E] |
| [B-C,C-D,D-E,E-C] |
+-------------------+

match p = (A where @id = 2101)-[r]->{1,3}(X)
RETURN r.p_string;
+---------------+
|    r.p_string |
+---------------+
|         [A-B] |
|     [A-B,B-A] |
| [A-B,B-A,A-B] |
+---------------+

match p = (a where @id = 6101)-[r]->{0,3}(x)
RETURN r.p_string;
+---------------+
|    r.p_string |
+---------------+
|            [] |
|         [A-B] |
|         [A-C] |
|     [A-B,B-D] |
|     [A-C,C-D] |
| [A-B,B-D,D-E] |
| [A-C,C-D,D-E] |
+---------------+

match p = (d where @id = 1104)-[r]-{0,3}(x)
RETURN r.p_string;
+---------------+
|    r.p_string |
+---------------+
|            [] |
|         [D-E] |
|         [C-D] |
|     [D-E,E-C] |
|     [D-E,D-E] |
|     [C-D,C-D] |
|     [C-D,B-C] |
|     [C-D,E-C] |
| [D-E,D-E,D-E] |
| [C-D,C-D,D-E] |
| [D-E,D-E,C-D] |
| [C-D,C-D,C-D] |
| [C-D,B-C,B-C] |
| [C-D,B-C,A-B] |
| [C-D,E-C,E-C] |
| [C-D,E-C,D-E] |
| [D-E,E-C,C-D] |
| [D-E,E-C,B-C] |
| [D-E,E-C,E-C] |
+---------------+

match p = (c where @id = 1103)-[r1]->{1,3}(xc)<-[r2]-(b)
RETURN p;
+--------------------------------------------------------------------------------------------------------------------------------------+
|                                                                                                                                    p |
+--------------------------------------------------------------------------------------------------------------------------------------+
|                                                             (1103:node5)-[:edge_n5_n5|0]->(1104:node5)<-[:edge_n5_n5|0]-(1103:node5) |
|                               (1103:node5)-[:edge_n5_n5|0]->(1104:node5)-[:edge_n5_n5|0]->(1105:node5)<-[:edge_n5_n5|0]-(1104:node5) |
| (1103:node5)-[:edge_n5_n5|0]->(1104:node5)-[:edge_n5_n5|0]->(1105:node5)-[:edge_n5_n5|0]->(1103:node5)<-[:edge_n5_n5|0]-(1102:node5) |
| (1103:node5)-[:edge_n5_n5|0]->(1104:node5)-[:edge_n5_n5|0]->(1105:node5)-[:edge_n5_n5|0]->(1103:node5)<-[:edge_n5_n5|0]-(1105:node5) |
+--------------------------------------------------------------------------------------------------------------------------------------+

MATCH (a:node5 where @id = 3101)-[r]-(b)
RETURN a, r, b;
+--------------+--------------------------------+--------------+
|            a |                              r |            b |
+--------------+--------------------------------+--------------+
| (3101:node5) | (3101)-[:edge_n5_n5|0]->(3101) | (3101:node5) |
+--------------+--------------------------------+--------------+

MATCH p = (a:node5 where @id = 3101)-[r]-(b)-(x)
RETURN p;
+--------------------------------------------------------------------------+
|                                                                        p |
+--------------------------------------------------------------------------+
| (3101:node5)-[:edge_n5_n5|0]->(3101:node5)-[:edge_n5_n5|0]->(3101:node5) |
+--------------------------------------------------------------------------+

MATCH p = (a:node5 where @id = 3101)-{0,3}(b)
RETURN p;
+--------------------------------------------------------------------------------------------------------+
|                                                                                                      p |
+--------------------------------------------------------------------------------------------------------+
|                                                                                           (3101:node5) |
|                                                             (3101:node5)-[:edge_n5_n5|0]->(3101:node5) |
|                               (3101:node5)-[:edge_n5_n5|0]->(3101:node5)-[:edge_n5_n5|0]->(3101:node5) |
| (3101:node5)-[:edge_n5_n5|0]->(3101:node5)-[:edge_n5_n5|0]->(3101:node5)-[:edge_n5_n5|0]->(3101:node5) |
+--------------------------------------------------------------------------------------------------------+

MATCH (a:node5 where p_long = 3101)-[r]-(b)
RETURN a, r, b;
+--------------+--------------------------------+--------------+
|            a |                              r |            b |
+--------------+--------------------------------+--------------+
| (3101:node5) | (3101)-[:edge_n5_n5|0]->(3101) | (3101:node5) |
+--------------+--------------------------------+--------------+

MATCH p = (a:node5 where p_long = 3101)-[r]-(b)-(x)
RETURN p;
+--------------------------------------------------------------------------+
|                                                                        p |
+--------------------------------------------------------------------------+
| (3101:node5)-[:edge_n5_n5|0]->(3101:node5)-[:edge_n5_n5|0]->(3101:node5) |
+--------------------------------------------------------------------------+

MATCH WALK (a where @id = 1101)-[r1]->(b)-[r2]->(c)-[r3]->(d)-[r4]->(e)
RETURN r1, r2, r3, r4, e.@id;
+--------------------------------+--------------------------------+--------------------------------+--------------------------------+-------+
|                             r1 |                             r2 |                             r3 |                             r4 | e.@id |
+--------------------------------+--------------------------------+--------------------------------+--------------------------------+-------+
| (1101)-[:edge_n5_n5|0]->(1102) | (1102)-[:edge_n5_n5|0]->(1103) | (1103)-[:edge_n5_n5|0]->(1104) | (1104)-[:edge_n5_n5|0]->(1105) |  1105 |
+--------------------------------+--------------------------------+--------------------------------+--------------------------------+-------+

match WALK (a where @id = 1101)-[r1]->(b)-[r2]->(c)-[r3]->(d)-[r4]->(e)-[r5]->(xc)
RETURN r1, r2, r3, r4, r5, c.@id, xc.@id;
+--------------------------------+--------------------------------+--------------------------------+--------------------------------+--------------------------------+-------+--------+
|                             r1 |                             r2 |                             r3 |                             r4 |                             r5 | c.@id | xc.@id |
+--------------------------------+--------------------------------+--------------------------------+--------------------------------+--------------------------------+-------+--------+
| (1101)-[:edge_n5_n5|0]->(1102) | (1102)-[:edge_n5_n5|0]->(1103) | (1103)-[:edge_n5_n5|0]->(1104) | (1104)-[:edge_n5_n5|0]->(1105) | (1105)-[:edge_n5_n5|0]->(1103) |  1103 |   1103 |
+--------------------------------+--------------------------------+--------------------------------+--------------------------------+--------------------------------+-------+--------+

match WALK (c where @id = 1103)-[r1]->(d)-[r2]->(e)-[r3]->(xc)<-[r4]-(b)
RETURN r1, r2, r3, r4, c.@id, xc.@id;
+--------------------------------+--------------------------------+--------------------------------+--------------------------------+-------+--------+
|                             r1 |                             r2 |                             r3 |                             r4 | c.@id | xc.@id |
+--------------------------------+--------------------------------+--------------------------------+--------------------------------+-------+--------+
| (1103)-[:edge_n5_n5|0]->(1104) | (1104)-[:edge_n5_n5|0]->(1105) | (1105)-[:edge_n5_n5|0]->(1103) | (1103)<-[:edge_n5_n5|0]-(1102) |  1103 |   1103 |
| (1103)-[:edge_n5_n5|0]->(1104) | (1104)-[:edge_n5_n5|0]->(1105) | (1105)-[:edge_n5_n5|0]->(1103) | (1103)<-[:edge_n5_n5|0]-(1105) |  1103 |   1103 |
+--------------------------------+--------------------------------+--------------------------------+--------------------------------+-------+--------+

match WALK (c where @id = 1103)-[r1]->(d)-[r2]->(e)-[r3]->(xc)-[xr1]->(xd)
RETURN r1, r2, r3, xr1, c.@id, xc.@id, d.@id, xd.@id;
+--------------------------------+--------------------------------+--------------------------------+--------------------------------+-------+--------+-------+--------+
|                             r1 |                             r2 |                             r3 |                            xr1 | c.@id | xc.@id | d.@id | xd.@id |
+--------------------------------+--------------------------------+--------------------------------+--------------------------------+-------+--------+-------+--------+
| (1103)-[:edge_n5_n5|0]->(1104) | (1104)-[:edge_n5_n5|0]->(1105) | (1105)-[:edge_n5_n5|0]->(1103) | (1103)-[:edge_n5_n5|0]->(1104) |  1103 |   1103 |  1104 |   1104 |
+--------------------------------+--------------------------------+--------------------------------+--------------------------------+-------+--------+-------+--------+

match WALK (c where @id = 1103)-[r1]->(d)-[r2]->(e)-[r3]->(xc)
RETURN r1, r2, r3, c.@id, xc.@id;
+--------------------------------+--------------------------------+--------------------------------+-------+--------+
|                             r1 |                             r2 |                             r3 | c.@id | xc.@id |
+--------------------------------+--------------------------------+--------------------------------+-------+--------+
| (1103)-[:edge_n5_n5|0]->(1104) | (1104)-[:edge_n5_n5|0]->(1105) | (1105)-[:edge_n5_n5|0]->(1103) |  1103 |   1103 |
+--------------------------------+--------------------------------+--------------------------------+-------+--------+

match WALK (a where @id = 1101)-[r1]->(b)<-[xr1]-(xa)
RETURN r1, xr1, a.@id, xa.@id;
+--------------------------------+--------------------------------+-------+--------+
|                             r1 |                            xr1 | a.@id | xa.@id |
+--------------------------------+--------------------------------+-------+--------+
| (1101)-[:edge_n5_n5|0]->(1102) | (1102)<-[:edge_n5_n5|0]-(1101) |  1101 |   1101 |
+--------------------------------+--------------------------------+-------+--------+

match WALK (a where @id = 1101)-[r1]-(b)-[r2_or_r1]-(c_or_a)
RETURN r1, r2_or_r1, a.@id, c_or_a.@id;
+--------------------------------+--------------------------------+-------+------------+
|                             r1 |                       r2_or_r1 | a.@id | c_or_a.@id |
+--------------------------------+--------------------------------+-------+------------+
| (1101)-[:edge_n5_n5|0]->(1102) | (1102)-[:edge_n5_n5|0]->(1103) |  1101 |       1103 |
| (1101)-[:edge_n5_n5|0]->(1102) | (1102)<-[:edge_n5_n5|0]-(1101) |  1101 |       1101 |
+--------------------------------+--------------------------------+-------+------------+

match WALK (a where @id = 2101)-[r1]->(b)-[r2]->(xa)
RETURN a, r1, b, r2, xa;
+--------------+--------------------------------+--------------+--------------------------------+--------------+
|            a |                             r1 |            b |                             r2 |           xa |
+--------------+--------------------------------+--------------+--------------------------------+--------------+
| (2101:node5) | (2101)-[:edge_n5_n5|0]->(2102) | (2102:node5) | (2102)-[:edge_n5_n5|0]->(2101) | (2101:node5) |
+--------------+--------------------------------+--------------+--------------------------------+--------------+

match WALK (d:node5 where p_long = 1104)-[r1]->(e)-[r2]->(c)-[r3]-(b_or_d)
RETURN d, r1, e, r2, c, r3, b_or_d;
+--------------+--------------------------------+--------------+--------------------------------+--------------+--------------------------------+--------------+
|            d |                             r1 |            e |                             r2 |            c |                             r3 |       b_or_d |
+--------------+--------------------------------+--------------+--------------------------------+--------------+--------------------------------+--------------+
| (1104:node5) | (1104)-[:edge_n5_n5|0]->(1105) | (1105:node5) | (1105)-[:edge_n5_n5|0]->(1103) | (1103:node5) | (1103)-[:edge_n5_n5|0]->(1104) | (1104:node5) |
| (1104:node5) | (1104)-[:edge_n5_n5|0]->(1105) | (1105:node5) | (1105)-[:edge_n5_n5|0]->(1103) | (1103:node5) | (1103)<-[:edge_n5_n5|0]-(1102) | (1102:node5) |
| (1104:node5) | (1104)-[:edge_n5_n5|0]->(1105) | (1105:node5) | (1105)-[:edge_n5_n5|0]->(1103) | (1103:node5) | (1103)<-[:edge_n5_n5|0]-(1105) | (1105:node5) |
+--------------+--------------------------------+--------------+--------------------------------+--------------+--------------------------------+--------------+

match p = WALK (d where @id = 1104)-[r]->{0,3}(x)
RETURN r.p_string;
+---------------+
|    r.p_string |
+---------------+
|            [] |
|         [D-E] |
|     [D-E,E-C] |
| [D-E,E-C,C-D] |
+---------------+

match p = WALK (b where @id = 1102)-[r]->{0,4}(x)
RETURN r.p_string;
+-------------------+
|        r.p_string |
+-------------------+
|                [] |
|             [B-C] |
|         [B-C,C-D] |
|     [B-C,C-D,D-E] |
| [B-C,C-D,D-E,E-C] |
+-------------------+

match p = WALK (A where @id = 2101)-[r]->{1,3}(X)
RETURN r.p_string;
+---------------+
|    r.p_string |
+---------------+
|         [A-B] |
|     [A-B,B-A] |
| [A-B,B-A,A-B] |
+---------------+

match p = WALK (a where @id = 6101)-[r]->{0,3}(x)
RETURN r.p_string;
+---------------+
|    r.p_string |
+---------------+
|            [] |
|         [A-B] |
|         [A-C] |
|     [A-B,B-D] |
|     [A-C,C-D] |
| [A-B,B-D,D-E] |
| [A-C,C-D,D-E] |
+---------------+

match p = WALK (d where @id = 1104)-[r]-{0,3}(x)
RETURN r.p_string;
+---------------+
|    r.p_string |
+---------------+
|            [] |
|         [D-E] |
|         [C-D] |
|     [D-E,E-C] |
|     [D-E,D-E] |
|     [C-D,C-D] |
|     [C-D,B-C] |
|     [C-D,E-C] |
| [D-E,D-E,D-E] |
| [C-D,C-D,D-E] |
| [D-E,D-E,C-D] |
| [C-D,C-D,C-D] |
| [C-D,B-C,B-C] |
| [C-D,B-C,A-B] |
| [C-D,E-C,E-C] |
| [C-D,E-C,D-E] |
| [D-E,E-C,C-D] |
| [D-E,E-C,B-C] |
| [D-E,E-C,E-C] |
+---------------+

match p = WALK (c where @id = 1103)-[r1]->{1,3}(xc)<-[r2]-(b)
RETURN p;
+--------------------------------------------------------------------------------------------------------------------------------------+
|                                                                                                                                    p |
+--------------------------------------------------------------------------------------------------------------------------------------+
|                                                             (1103:node5)-[:edge_n5_n5|0]->(1104:node5)<-[:edge_n5_n5|0]-(1103:node5) |
|                               (1103:node5)-[:edge_n5_n5|0]->(1104:node5)-[:edge_n5_n5|0]->(1105:node5)<-[:edge_n5_n5|0]-(1104:node5) |
| (1103:node5)-[:edge_n5_n5|0]->(1104:node5)-[:edge_n5_n5|0]->(1105:node5)-[:edge_n5_n5|0]->(1103:node5)<-[:edge_n5_n5|0]-(1102:node5) |
| (1103:node5)-[:edge_n5_n5|0]->(1104:node5)-[:edge_n5_n5|0]->(1105:node5)-[:edge_n5_n5|0]->(1103:node5)<-[:edge_n5_n5|0]-(1105:node5) |
+--------------------------------------------------------------------------------------------------------------------------------------+

MATCH WALK (a:node5 where @id = 3101)-[r]-(b)
RETURN a, r, b;
+--------------+--------------------------------+--------------+
|            a |                              r |            b |
+--------------+--------------------------------+--------------+
| (3101:node5) | (3101)-[:edge_n5_n5|0]->(3101) | (3101:node5) |
+--------------+--------------------------------+--------------+

MATCH p = WALK (a:node5 where @id = 3101)-[r]-(b)-(x)
RETURN p;
+--------------------------------------------------------------------------+
|                                                                        p |
+--------------------------------------------------------------------------+
| (3101:node5)-[:edge_n5_n5|0]->(3101:node5)-[:edge_n5_n5|0]->(3101:node5) |
+--------------------------------------------------------------------------+

MATCH p = WALK (a:node5 where @id = 3101)-{0,3}(b)
RETURN p;
+--------------------------------------------------------------------------------------------------------+
|                                                                                                      p |
+--------------------------------------------------------------------------------------------------------+
|                                                                                           (3101:node5) |
|                                                             (3101:node5)-[:edge_n5_n5|0]->(3101:node5) |
|                               (3101:node5)-[:edge_n5_n5|0]->(3101:node5)-[:edge_n5_n5|0]->(3101:node5) |
| (3101:node5)-[:edge_n5_n5|0]->(3101:node5)-[:edge_n5_n5|0]->(3101:node5)-[:edge_n5_n5|0]->(3101:node5) |
+--------------------------------------------------------------------------------------------------------+

MATCH WALK (a:node5 where p_long = 3101)-[r]-(b)
RETURN a, r, b;
+--------------+--------------------------------+--------------+
|            a |                              r |            b |
+--------------+--------------------------------+--------------+
| (3101:node5) | (3101)-[:edge_n5_n5|0]->(3101) | (3101:node5) |
+--------------+--------------------------------+--------------+

MATCH p = WALK (a:node5 where p_long = 3101)-[r]-(b)-(x)
RETURN p;
+--------------------------------------------------------------------------+
|                                                                        p |
+--------------------------------------------------------------------------+
| (3101:node5)-[:edge_n5_n5|0]->(3101:node5)-[:edge_n5_n5|0]->(3101:node5) |
+--------------------------------------------------------------------------+

MATCH TRAIL (a where @id = 1101)-[r1]->(b)-[r2]->(c)-[r3]->(d)-[r4]->(e)
RETURN r1, r2, r3, r4, e.@id;
+--------------------------------+--------------------------------+--------------------------------+--------------------------------+-------+
|                             r1 |                             r2 |                             r3 |                             r4 | e.@id |
+--------------------------------+--------------------------------+--------------------------------+--------------------------------+-------+
| (1101)-[:edge_n5_n5|0]->(1102) | (1102)-[:edge_n5_n5|0]->(1103) | (1103)-[:edge_n5_n5|0]->(1104) | (1104)-[:edge_n5_n5|0]->(1105) |  1105 |
+--------------------------------+--------------------------------+--------------------------------+--------------------------------+-------+

match TRAIL (a where @id = 1101)-[r1]->(b)-[r2]->(c)-[r3]->(d)-[r4]->(e)-[r5]->(xc)
RETURN r1, r2, r3, r4, r5, c.@id, xc.@id;
+--------------------------------+--------------------------------+--------------------------------+--------------------------------+--------------------------------+-------+--------+
|                             r1 |                             r2 |                             r3 |                             r4 |                             r5 | c.@id | xc.@id |
+--------------------------------+--------------------------------+--------------------------------+--------------------------------+--------------------------------+-------+--------+
| (1101)-[:edge_n5_n5|0]->(1102) | (1102)-[:edge_n5_n5|0]->(1103) | (1103)-[:edge_n5_n5|0]->(1104) | (1104)-[:edge_n5_n5|0]->(1105) | (1105)-[:edge_n5_n5|0]->(1103) |  1103 |   1103 |
+--------------------------------+--------------------------------+--------------------------------+--------------------------------+--------------------------------+-------+--------+

match TRAIL (c where @id = 1103)-[r1]->(d)-[r2]->(e)-[r3]->(xc)<-[r4]-(b)
RETURN r1, r2, r3, r4, c.@id, xc.@id;
+--------------------------------+--------------------------------+--------------------------------+--------------------------------+-------+--------+
|                             r1 |                             r2 |                             r3 |                             r4 | c.@id | xc.@id |
+--------------------------------+--------------------------------+--------------------------------+--------------------------------+-------+--------+
| (1103)-[:edge_n5_n5|0]->(1104) | (1104)-[:edge_n5_n5|0]->(1105) | (1105)-[:edge_n5_n5|0]->(1103) | (1103)<-[:edge_n5_n5|0]-(1102) |  1103 |   1103 |
+--------------------------------+--------------------------------+--------------------------------+--------------------------------+-------+--------+

match TRAIL (c where @id = 1103)-[r1]->(d)-[r2]->(e)-[r3]->(xc)-[xr1]->(xd)
RETURN r1, r2, r3, xr1, c.@id, xc.@id, d.@id, xd.@id;

match TRAIL (c where @id = 1103)-[r1]->(d)-[r2]->(e)-[r3]->(xc)
RETURN r1, r2, r3, c.@id, xc.@id;
+--------------------------------+--------------------------------+--------------------------------+-------+--------+
|                             r1 |                             r2 |                             r3 | c.@id | xc.@id |
+--------------------------------+--------------------------------+--------------------------------+-------+--------+
| (1103)-[:edge_n5_n5|0]->(1104) | (1104)-[:edge_n5_n5|0]->(1105) | (1105)-[:edge_n5_n5|0]->(1103) |  1103 |   1103 |
+--------------------------------+--------------------------------+--------------------------------+-------+--------+

match TRAIL (a where @id = 1101)-[r1]->(b)<-[xr1]-(xa)
RETURN r1, xr1, a.@id, xa.@id;

match TRAIL (a where @id = 1101)-[r1]-(b)-[r2_or_r1]-(c_or_a)
RETURN r1, r2_or_r1, a.@id, c_or_a.@id;
+--------------------------------+--------------------------------+-------+------------+
|                             r1 |                       r2_or_r1 | a.@id | c_or_a.@id |
+--------------------------------+--------------------------------+-------+------------+
| (1101)-[:edge_n5_n5|0]->(1102) | (1102)-[:edge_n5_n5|0]->(1103) |  1101 |       1103 |
+--------------------------------+--------------------------------+-------+------------+

match TRAIL (a where @id = 2101)-[r1]->(b)-[r2]->(xa)
RETURN a, r1, b, r2, xa;
+--------------+--------------------------------+--------------+--------------------------------+--------------+
|            a |                             r1 |            b |                             r2 |           xa |
+--------------+--------------------------------+--------------+--------------------------------+--------------+
| (2101:node5) | (2101)-[:edge_n5_n5|0]->(2102) | (2102:node5) | (2102)-[:edge_n5_n5|0]->(2101) | (2101:node5) |
+--------------+--------------------------------+--------------+--------------------------------+--------------+

match TRAIL (d:node5 where p_long = 1104)-[r1]->(e)-[r2]->(c)-[r3]-(b_or_d)
RETURN d, r1, e, r2, c, r3, b_or_d;
+--------------+--------------------------------+--------------+--------------------------------+--------------+--------------------------------+--------------+
|            d |                             r1 |            e |                             r2 |            c |                             r3 |       b_or_d |
+--------------+--------------------------------+--------------+--------------------------------+--------------+--------------------------------+--------------+
| (1104:node5) | (1104)-[:edge_n5_n5|0]->(1105) | (1105:node5) | (1105)-[:edge_n5_n5|0]->(1103) | (1103:node5) | (1103)-[:edge_n5_n5|0]->(1104) | (1104:node5) |
| (1104:node5) | (1104)-[:edge_n5_n5|0]->(1105) | (1105:node5) | (1105)-[:edge_n5_n5|0]->(1103) | (1103:node5) | (1103)<-[:edge_n5_n5|0]-(1102) | (1102:node5) |
+--------------+--------------------------------+--------------+--------------------------------+--------------+--------------------------------+--------------+

match p = TRAIL (d where @id = 1104)-[r]->{0,3}(x)
RETURN r.p_string;
+---------------+
|    r.p_string |
+---------------+
|            [] |
|         [D-E] |
|     [D-E,E-C] |
| [D-E,E-C,C-D] |
+---------------+

match p = TRAIL (b where @id = 1102)-[r]->{0,4}(x)
RETURN r.p_string;
+-------------------+
|        r.p_string |
+-------------------+
|                [] |
|             [B-C] |
|         [B-C,C-D] |
|     [B-C,C-D,D-E] |
| [B-C,C-D,D-E,E-C] |
+-------------------+

match p = TRAIL (A where @id = 2101)-[r]->{1,3}(X)
RETURN r.p_string;
+------------+
| r.p_string |
+------------+
|      [A-B] |
|  [A-B,B-A] |
+------------+

match p = TRAIL (a where @id = 6101)-[r]->{0,3}(x)
RETURN r.p_string;
+---------------+
|    r.p_string |
+---------------+
|            [] |
|         [A-B] |
|         [A-C] |
|     [A-B,B-D] |
|     [A-C,C-D] |
| [A-B,B-D,D-E] |
| [A-C,C-D,D-E] |
+---------------+

match p = TRAIL (d where @id = 1104)-[r]-{0,3}(x)
RETURN r.p_string;
+---------------+
|    r.p_string |
+---------------+
|            [] |
|         [D-E] |
|         [C-D] |
|     [D-E,E-C] |
|     [C-D,B-C] |
|     [C-D,E-C] |
| [C-D,B-C,A-B] |
| [C-D,E-C,D-E] |
| [D-E,E-C,C-D] |
| [D-E,E-C,B-C] |
+---------------+

match p = TRAIL (c where @id = 1103)-[r1]->{1,3}(xc)<-[r2]-(b)
RETURN p;
+--------------------------------------------------------------------------------------------------------------------------------------+
|                                                                                                                                    p |
+--------------------------------------------------------------------------------------------------------------------------------------+
| (1103:node5)-[:edge_n5_n5|0]->(1104:node5)-[:edge_n5_n5|0]->(1105:node5)-[:edge_n5_n5|0]->(1103:node5)<-[:edge_n5_n5|0]-(1102:node5) |
+--------------------------------------------------------------------------------------------------------------------------------------+

MATCH TRAIL (a:node5 where @id = 3101)-[r]-(b)
RETURN a, r, b;
+--------------+--------------------------------+--------------+
|            a |                              r |            b |
+--------------+--------------------------------+--------------+
| (3101:node5) | (3101)-[:edge_n5_n5|0]->(3101) | (3101:node5) |
+--------------+--------------------------------+--------------+

MATCH p = TRAIL (a:node5 where @id = 3101)-[r]-(b)-(x)
RETURN p;

MATCH p = TRAIL (a:node5 where @id = 3101)-{0,3}(b)
RETURN p;
+--------------------------------------------+
|                                          p |
+--------------------------------------------+
|                               (3101:node5) |
| (3101:node5)-[:edge_n5_n5|0]->(3101:node5) |
+--------------------------------------------+

MATCH TRAIL (a:node5 where p_long = 3101)-[r]-(b)
RETURN a, r, b;
+--------------+--------------------------------+--------------+
|            a |                              r |            b |
+--------------+--------------------------------+--------------+
| (3101:node5) | (3101)-[:edge_n5_n5|0]->(3101) | (3101:node5) |
+--------------+--------------------------------+--------------+

MATCH p = TRAIL (a:node5 where p_long = 3101)-[r]-(b)-(x)
RETURN p;

MATCH SIMPLE (a where @id = 1101)-[r1]->(b)-[r2]->(c)-[r3]->(d)-[r4]->(e)
RETURN r1, r2, r3, r4, e.@id;
+--------------------------------+--------------------------------+--------------------------------+--------------------------------+-------+
|                             r1 |                             r2 |                             r3 |                             r4 | e.@id |
+--------------------------------+--------------------------------+--------------------------------+--------------------------------+-------+
| (1101)-[:edge_n5_n5|0]->(1102) | (1102)-[:edge_n5_n5|0]->(1103) | (1103)-[:edge_n5_n5|0]->(1104) | (1104)-[:edge_n5_n5|0]->(1105) |  1105 |
+--------------------------------+--------------------------------+--------------------------------+--------------------------------+-------+

match SIMPLE (a where @id = 1101)-[r1]->(b)-[r2]->(c)-[r3]->(d)-[r4]->(e)-[r5]->(xc)
RETURN r1, r2, r3, r4, r5, c.@id, xc.@id;

match SIMPLE (c where @id = 1103)-[r1]->(d)-[r2]->(e)-[r3]->(xc)<-[r4]-(b)
RETURN r1, r2, r3, r4, c.@id, xc.@id;

match SIMPLE (c where @id = 1103)-[r1]->(d)-[r2]->(e)-[r3]->(xc)-[xr1]->(xd)
RETURN r1, r2, r3, xr1, c.@id, xc.@id, d.@id, xd.@id;

match SIMPLE (c where @id = 1103)-[r1]->(d)-[r2]->(e)-[r3]->(xc)
RETURN r1, r2, r3, c.@id, xc.@id;
+--------------------------------+--------------------------------+--------------------------------+-------+--------+
|                             r1 |                             r2 |                             r3 | c.@id | xc.@id |
+--------------------------------+--------------------------------+--------------------------------+-------+--------+
| (1103)-[:edge_n5_n5|0]->(1104) | (1104)-[:edge_n5_n5|0]->(1105) | (1105)-[:edge_n5_n5|0]->(1103) |  1103 |   1103 |
+--------------------------------+--------------------------------+--------------------------------+-------+--------+

match SIMPLE (a where @id = 1101)-[r1]->(b)<-[xr1]-(xa)
RETURN r1, xr1, a.@id, xa.@id;

match SIMPLE (a where @id = 1101)-[r1]-(b)-[r2_or_r1]-(c_or_a)
RETURN r1, r2_or_r1, a.@id, c_or_a.@id;
+--------------------------------+--------------------------------+-------+------------+
|                             r1 |                       r2_or_r1 | a.@id | c_or_a.@id |
+--------------------------------+--------------------------------+-------+------------+
| (1101)-[:edge_n5_n5|0]->(1102) | (1102)-[:edge_n5_n5|0]->(1103) |  1101 |       1103 |
+--------------------------------+--------------------------------+-------+------------+

match SIMPLE (a where @id = 2101)-[r1]->(b)-[r2]->(xa)
RETURN a, r1, b, r2, xa;
+--------------+--------------------------------+--------------+--------------------------------+--------------+
|            a |                             r1 |            b |                             r2 |           xa |
+--------------+--------------------------------+--------------+--------------------------------+--------------+
| (2101:node5) | (2101)-[:edge_n5_n5|0]->(2102) | (2102:node5) | (2102)-[:edge_n5_n5|0]->(2101) | (2101:node5) |
+--------------+--------------------------------+--------------+--------------------------------+--------------+

match SIMPLE (d:node5 where p_long = 1104)-[r1]->(e)-[r2]->(c)-[r3]-(b_or_d)
RETURN d, r1, e, r2, c, r3, b_or_d;
+--------------+--------------------------------+--------------+--------------------------------+--------------+--------------------------------+--------------+
|            d |                             r1 |            e |                             r2 |            c |                             r3 |       b_or_d |
+--------------+--------------------------------+--------------+--------------------------------+--------------+--------------------------------+--------------+
| (1104:node5) | (1104)-[:edge_n5_n5|0]->(1105) | (1105:node5) | (1105)-[:edge_n5_n5|0]->(1103) | (1103:node5) | (1103)-[:edge_n5_n5|0]->(1104) | (1104:node5) |
| (1104:node5) | (1104)-[:edge_n5_n5|0]->(1105) | (1105:node5) | (1105)-[:edge_n5_n5|0]->(1103) | (1103:node5) | (1103)<-[:edge_n5_n5|0]-(1102) | (1102:node5) |
+--------------+--------------------------------+--------------+--------------------------------+--------------+--------------------------------+--------------+

match p = SIMPLE (d where @id = 1104)-[r]->{0,3}(x)
RETURN r.p_string;
+---------------+
|    r.p_string |
+---------------+
|            [] |
|         [D-E] |
|     [D-E,E-C] |
| [D-E,E-C,C-D] |
+---------------+

match p = SIMPLE (b where @id = 1102)-[r]->{0,4}(x)
RETURN r.p_string;
+---------------+
|    r.p_string |
+---------------+
|            [] |
|         [B-C] |
|     [B-C,C-D] |
| [B-C,C-D,D-E] |
+---------------+

match p = SIMPLE (A where @id = 2101)-[r]->{1,3}(X)
RETURN r.p_string;
+------------+
| r.p_string |
+------------+
|      [A-B] |
|  [A-B,B-A] |
+------------+

match p = SIMPLE (a where @id = 6101)-[r]->{0,3}(x)
RETURN r.p_string;
+---------------+
|    r.p_string |
+---------------+
|            [] |
|         [A-B] |
|         [A-C] |
|     [A-B,B-D] |
|     [A-C,C-D] |
| [A-B,B-D,D-E] |
| [A-C,C-D,D-E] |
+---------------+

match p = SIMPLE (d where @id = 1104)-[r]-{0,3}(x)
RETURN r.p_string;
+---------------+
|    r.p_string |
+---------------+
|            [] |
|         [D-E] |
|         [C-D] |
|     [D-E,E-C] |
|     [C-D,B-C] |
|     [C-D,E-C] |
| [C-D,B-C,A-B] |
| [C-D,E-C,D-E] |
| [D-E,E-C,C-D] |
| [D-E,E-C,B-C] |
+---------------+

match p = SIMPLE (c where @id = 1103)-[r1]->{1,3}(xc)<-[r2]-(b)
RETURN p;

MATCH SIMPLE (a:node5 where @id = 3101)-[r]-(b)
RETURN a, r, b;
+--------------+--------------------------------+--------------+
|            a |                              r |            b |
+--------------+--------------------------------+--------------+
| (3101:node5) | (3101)-[:edge_n5_n5|0]->(3101) | (3101:node5) |
+--------------+--------------------------------+--------------+

MATCH p = SIMPLE (a:node5 where @id = 3101)-[r]-(b)-(x)
RETURN p;

MATCH p = SIMPLE (a:node5 where @id = 3101)-{0,3}(b)
RETURN p;
+--------------------------------------------+
|                                          p |
+--------------------------------------------+
|                               (3101:node5) |
| (3101:node5)-[:edge_n5_n5|0]->(3101:node5) |
+--------------------------------------------+

MATCH SIMPLE (a:node5 where p_long = 3101)-[r]-(b)
RETURN a, r, b;
+--------------+--------------------------------+--------------+
|            a |                              r |            b |
+--------------+--------------------------------+--------------+
| (3101:node5) | (3101)-[:edge_n5_n5|0]->(3101) | (3101:node5) |
+--------------+--------------------------------+--------------+

MATCH p = SIMPLE (a:node5 where p_long = 3101)-[r]-(b)-(x)
RETURN p;

MATCH ACYCLIC (a where @id = 1101)-[r1]->(b)-[r2]->(c)-[r3]->(d)-[r4]->(e)
RETURN r1, r2, r3, r4, e.@id;
+--------------------------------+--------------------------------+--------------------------------+--------------------------------+-------+
|                             r1 |                             r2 |                             r3 |                             r4 | e.@id |
+--------------------------------+--------------------------------+--------------------------------+--------------------------------+-------+
| (1101)-[:edge_n5_n5|0]->(1102) | (1102)-[:edge_n5_n5|0]->(1103) | (1103)-[:edge_n5_n5|0]->(1104) | (1104)-[:edge_n5_n5|0]->(1105) |  1105 |
+--------------------------------+--------------------------------+--------------------------------+--------------------------------+-------+

match ACYCLIC (a where @id = 1101)-[r1]->(b)-[r2]->(c)-[r3]->(d)-[r4]->(e)-[r5]->(xc)
RETURN r1, r2, r3, r4, r5, c.@id, xc.@id;

match ACYCLIC (c where @id = 1103)-[r1]->(d)-[r2]->(e)-[r3]->(xc)<-[r4]-(b)
RETURN r1, r2, r3, r4, c.@id, xc.@id;

match ACYCLIC (c where @id = 1103)-[r1]->(d)-[r2]->(e)-[r3]->(xc)-[xr1]->(xd)
RETURN r1, r2, r3, xr1, c.@id, xc.@id, d.@id, xd.@id;

match ACYCLIC (c where @id = 1103)-[r1]->(d)-[r2]->(e)-[r3]->(xc)
RETURN r1, r2, r3, c.@id, xc.@id;

match ACYCLIC (a where @id = 1101)-[r1]->(b)<-[xr1]-(xa)
RETURN r1, xr1, a.@id, xa.@id;

match ACYCLIC (a where @id = 1101)-[r1]-(b)-[r2_or_r1]-(c_or_a)
RETURN r1, r2_or_r1, a.@id, c_or_a.@id;
+--------------------------------+--------------------------------+-------+------------+
|                             r1 |                       r2_or_r1 | a.@id | c_or_a.@id |
+--------------------------------+--------------------------------+-------+------------+
| (1101)-[:edge_n5_n5|0]->(1102) | (1102)-[:edge_n5_n5|0]->(1103) |  1101 |       1103 |
+--------------------------------+--------------------------------+-------+------------+

match ACYCLIC (a where @id = 2101)-[r1]->(b)-[r2]->(xa)
RETURN a, r1, b, r2, xa;

match ACYCLIC (d:node5 where p_long = 1104)-[r1]->(e)-[r2]->(c)-[r3]-(b_or_d)
RETURN d, r1, e, r2, c, r3, b_or_d;
+--------------+--------------------------------+--------------+--------------------------------+--------------+--------------------------------+--------------+
|            d |                             r1 |            e |                             r2 |            c |                             r3 |       b_or_d |
+--------------+--------------------------------+--------------+--------------------------------+--------------+--------------------------------+--------------+
| (1104:node5) | (1104)-[:edge_n5_n5|0]->(1105) | (1105:node5) | (1105)-[:edge_n5_n5|0]->(1103) | (1103:node5) | (1103)<-[:edge_n5_n5|0]-(1102) | (1102:node5) |
+--------------+--------------------------------+--------------+--------------------------------+--------------+--------------------------------+--------------+

match p = ACYCLIC (d where @id = 1104)-[r]->{0,3}(x)
RETURN r.p_string;
+------------+
| r.p_string |
+------------+
|         [] |
|      [D-E] |
|  [D-E,E-C] |
+------------+

match p = ACYCLIC (b where @id = 1102)-[r]->{0,4}(x)
RETURN r.p_string;
+---------------+
|    r.p_string |
+---------------+
|            [] |
|         [B-C] |
|     [B-C,C-D] |
| [B-C,C-D,D-E] |
+---------------+

match p = ACYCLIC (A where @id = 2101)-[r]->{1,3}(X)
RETURN r.p_string;
+------------+
| r.p_string |
+------------+
|      [A-B] |
+------------+

match p = ACYCLIC (a where @id = 6101)-[r]->{0,3}(x)
RETURN r.p_string;
+---------------+
|    r.p_string |
+---------------+
|            [] |
|         [A-B] |
|         [A-C] |
|     [A-B,B-D] |
|     [A-C,C-D] |
| [A-B,B-D,D-E] |
| [A-C,C-D,D-E] |
+---------------+

match p = ACYCLIC (d where @id = 1104)-[r]-{0,3}(x)
RETURN r.p_string;
+---------------+
|    r.p_string |
+---------------+
|            [] |
|         [D-E] |
|         [C-D] |
|     [D-E,E-C] |
|     [C-D,B-C] |
|     [C-D,E-C] |
| [C-D,B-C,A-B] |
| [D-E,E-C,B-C] |
+---------------+

match p = ACYCLIC (c where @id = 1103)-[r1]->{1,3}(xc)<-[r2]-(b)
RETURN p;

MATCH ACYCLIC (a:node5 where @id = 3101)-[r]-(b)
RETURN a, r, b;

MATCH p = ACYCLIC (a:node5 where @id = 3101)-[r]-(b)-(x)
RETURN p;

MATCH p = ACYCLIC (a:node5 where @id = 3101)-{0,3}(b)
RETURN p;
+--------------+
|            p |
+--------------+
| (3101:node5) |
+--------------+

MATCH ACYCLIC (a:node5 where p_long = 3101)-[r]-(b)
RETURN a, r, b;

MATCH p = ACYCLIC (a:node5 where p_long = 3101)-[r]-(b)-(x)
RETURN p;

DELETE n MATCH (n:node5{@id:1101});

DELETE n MATCH (n:node5{@id:1102});

DELETE n MATCH (n:node5{@id:1103});

DELETE n MATCH (n:node5{@id:1104});

DELETE n MATCH (n:node5{@id:1105});

DELETE n MATCH (n:node5{@id:2101});

DELETE n MATCH (n:node5{@id:2102});

DELETE n MATCH (n:node5{@id:3101});

DELETE r MATCH ()-[r:edge_n5_n5{@src_id:1101, @dst_id:1102, @timestamp:0}]->();

DELETE r MATCH ()-[r:edge_n5_n5{@src_id:1102, @dst_id:1103, @timestamp:0}]->();

DELETE r MATCH ()-[r:edge_n5_n5{@src_id:1103, @dst_id:1104, @timestamp:0}]->();

DELETE r MATCH ()-[r:edge_n5_n5{@src_id:1104, @dst_id:1105, @timestamp:0}]->();

DELETE r MATCH ()-[r:edge_n5_n5{@src_id:1105, @dst_id:1103, @timestamp:0}]->();

DELETE r MATCH ()-[r:edge_n5_n5{@src_id:2101, @dst_id:2102, @timestamp:0}]->();

DELETE r MATCH ()-[r:edge_n5_n5{@src_id:2102, @dst_id:2101, @timestamp:0}]->();

DELETE r MATCH ()-[r:edge_n5_n5{@src_id:3101, @dst_id:3101, @timestamp:0}]->();

DELETE r MATCH ()-[r:edge_n5_n5{@src_id:6101, @dst_id:6102, @timestamp:0}]->();

DELETE r MATCH ()-[r:edge_n5_n5{@src_id:6101, @dst_id:6103, @timestamp:0}]->();

DELETE r MATCH ()-[r:edge_n5_n5{@src_id:6102, @dst_id:6104, @timestamp:0}]->();

DELETE r MATCH ()-[r:edge_n5_n5{@src_id:6103, @dst_id:1104, @timestamp:0}]->();

DELETE r MATCH ()-[r:edge_n5_n5{@src_id:6104, @dst_id:1105, @timestamp:0}]->();

DELETE n MATCH (n:node5{@id:1101});

DELETE n MATCH (n:node5{@id:1102});

DELETE n MATCH (n:node5{@id:1103});

DELETE n MATCH (n:node5{@id:1104});

DELETE n MATCH (n:node5{@id:1105});

DELETE n MATCH (n:node5{@id:2101});

DELETE n MATCH (n:node5{@id:2102});

DELETE n MATCH (n:node5{@id:3101});

DELETE n MATCH (n:node5{@id:6101});

DELETE n MATCH (n:node5{@id:6102});

DELETE n MATCH (n:node5{@id:6103});

DELETE n MATCH (n:node5{@id:6104});
