match p = (n1 where @id = 1)-[r1]->(n2)-[r2]->(n3)
RETURN p order by p;
+--------------------------------------------------------------------+
|                                                                  p |
+--------------------------------------------------------------------+
| (1:node1)-[:edge_n1_n2|0]->(10:node2)-[:edge_n2_n3|0]->(100:node3) |
| (1:node1)-[:edge_n1_n2|0]->(10:node2)-[:edge_n2_n3|0]->(101:node3) |
| (1:node1)-[:edge_n1_n2|0]->(10:node2)-[:edge_n2_n3|0]->(102:node3) |
| (1:node1)-[:edge_n1_n2|0]->(11:node2)-[:edge_n2_n3|0]->(110:node3) |
| (1:node1)-[:edge_n1_n2|0]->(11:node2)-[:edge_n2_n3|0]->(111:node3) |
| (1:node1)-[:edge_n1_n2|0]->(11:node2)-[:edge_n2_n3|0]->(112:node3) |
| (1:node1)-[:edge_n1_n2|0]->(12:node2)-[:edge_n2_n3|0]->(120:node3) |
| (1:node1)-[:edge_n1_n2|0]->(12:node2)-[:edge_n2_n3|0]->(121:node3) |
| (1:node1)-[:edge_n1_n2|0]->(12:node2)-[:edge_n2_n3|0]->(122:node3) |
+--------------------------------------------------------------------+

match p = (n where @id = 1)-[r]->{0,2}(m)
RETURN p order by p;
+--------------------------------------------------------------------+
|                                                                  p |
+--------------------------------------------------------------------+
|                                                          (1:node1) |
|                              (1:node1)-[:edge_n1_n2|0]->(10:node2) |
|                              (1:node1)-[:edge_n1_n2|0]->(11:node2) |
|                              (1:node1)-[:edge_n1_n2|0]->(12:node2) |
| (1:node1)-[:edge_n1_n2|0]->(10:node2)-[:edge_n2_n3|0]->(100:node3) |
| (1:node1)-[:edge_n1_n2|0]->(10:node2)-[:edge_n2_n3|0]->(101:node3) |
| (1:node1)-[:edge_n1_n2|0]->(10:node2)-[:edge_n2_n3|0]->(102:node3) |
| (1:node1)-[:edge_n1_n2|0]->(11:node2)-[:edge_n2_n3|0]->(110:node3) |
| (1:node1)-[:edge_n1_n2|0]->(11:node2)-[:edge_n2_n3|0]->(111:node3) |
| (1:node1)-[:edge_n1_n2|0]->(11:node2)-[:edge_n2_n3|0]->(112:node3) |
| (1:node1)-[:edge_n1_n2|0]->(12:node2)-[:edge_n2_n3|0]->(120:node3) |
| (1:node1)-[:edge_n1_n2|0]->(12:node2)-[:edge_n2_n3|0]->(121:node3) |
| (1:node1)-[:edge_n1_n2|0]->(12:node2)-[:edge_n2_n3|0]->(122:node3) |
+--------------------------------------------------------------------+

match p = (n where @id = 1)-[r]->{1,2}(m) RETURN p order by p;
+--------------------------------------------------------------------+
|                                                                  p |
+--------------------------------------------------------------------+
|                              (1:node1)-[:edge_n1_n2|0]->(10:node2) |
|                              (1:node1)-[:edge_n1_n2|0]->(11:node2) |
|                              (1:node1)-[:edge_n1_n2|0]->(12:node2) |
| (1:node1)-[:edge_n1_n2|0]->(10:node2)-[:edge_n2_n3|0]->(100:node3) |
| (1:node1)-[:edge_n1_n2|0]->(10:node2)-[:edge_n2_n3|0]->(101:node3) |
| (1:node1)-[:edge_n1_n2|0]->(10:node2)-[:edge_n2_n3|0]->(102:node3) |
| (1:node1)-[:edge_n1_n2|0]->(11:node2)-[:edge_n2_n3|0]->(110:node3) |
| (1:node1)-[:edge_n1_n2|0]->(11:node2)-[:edge_n2_n3|0]->(111:node3) |
| (1:node1)-[:edge_n1_n2|0]->(11:node2)-[:edge_n2_n3|0]->(112:node3) |
| (1:node1)-[:edge_n1_n2|0]->(12:node2)-[:edge_n2_n3|0]->(120:node3) |
| (1:node1)-[:edge_n1_n2|0]->(12:node2)-[:edge_n2_n3|0]->(121:node3) |
| (1:node1)-[:edge_n1_n2|0]->(12:node2)-[:edge_n2_n3|0]->(122:node3) |
+--------------------------------------------------------------------+

match p = (n where @id = 1)-[r]->{0,2}(m) RETURN p, length(p) order by p;
+--------------------------------------------------------------------+-----------+
|                                                                  p | length(p) |
+--------------------------------------------------------------------+-----------+
|                                                          (1:node1) |         0 |
|                              (1:node1)-[:edge_n1_n2|0]->(10:node2) |         1 |
|                              (1:node1)-[:edge_n1_n2|0]->(11:node2) |         1 |
|                              (1:node1)-[:edge_n1_n2|0]->(12:node2) |         1 |
| (1:node1)-[:edge_n1_n2|0]->(10:node2)-[:edge_n2_n3|0]->(100:node3) |         2 |
| (1:node1)-[:edge_n1_n2|0]->(10:node2)-[:edge_n2_n3|0]->(101:node3) |         2 |
| (1:node1)-[:edge_n1_n2|0]->(10:node2)-[:edge_n2_n3|0]->(102:node3) |         2 |
| (1:node1)-[:edge_n1_n2|0]->(11:node2)-[:edge_n2_n3|0]->(110:node3) |         2 |
| (1:node1)-[:edge_n1_n2|0]->(11:node2)-[:edge_n2_n3|0]->(111:node3) |         2 |
| (1:node1)-[:edge_n1_n2|0]->(11:node2)-[:edge_n2_n3|0]->(112:node3) |         2 |
| (1:node1)-[:edge_n1_n2|0]->(12:node2)-[:edge_n2_n3|0]->(120:node3) |         2 |
| (1:node1)-[:edge_n1_n2|0]->(12:node2)-[:edge_n2_n3|0]->(121:node3) |         2 |
| (1:node1)-[:edge_n1_n2|0]->(12:node2)-[:edge_n2_n3|0]->(122:node3) |         2 |
+--------------------------------------------------------------------+-----------+

match p = (n where @id = 1)-[r]->{1,2}(m) RETURN p, length(p) order by p;
+--------------------------------------------------------------------+-----------+
|                                                                  p | length(p) |
+--------------------------------------------------------------------+-----------+
|                              (1:node1)-[:edge_n1_n2|0]->(10:node2) |         1 |
|                              (1:node1)-[:edge_n1_n2|0]->(11:node2) |         1 |
|                              (1:node1)-[:edge_n1_n2|0]->(12:node2) |         1 |
| (1:node1)-[:edge_n1_n2|0]->(10:node2)-[:edge_n2_n3|0]->(100:node3) |         2 |
| (1:node1)-[:edge_n1_n2|0]->(10:node2)-[:edge_n2_n3|0]->(101:node3) |         2 |
| (1:node1)-[:edge_n1_n2|0]->(10:node2)-[:edge_n2_n3|0]->(102:node3) |         2 |
| (1:node1)-[:edge_n1_n2|0]->(11:node2)-[:edge_n2_n3|0]->(110:node3) |         2 |
| (1:node1)-[:edge_n1_n2|0]->(11:node2)-[:edge_n2_n3|0]->(111:node3) |         2 |
| (1:node1)-[:edge_n1_n2|0]->(11:node2)-[:edge_n2_n3|0]->(112:node3) |         2 |
| (1:node1)-[:edge_n1_n2|0]->(12:node2)-[:edge_n2_n3|0]->(120:node3) |         2 |
| (1:node1)-[:edge_n1_n2|0]->(12:node2)-[:edge_n2_n3|0]->(121:node3) |         2 |
| (1:node1)-[:edge_n1_n2|0]->(12:node2)-[:edge_n2_n3|0]->(122:node3) |         2 |
+--------------------------------------------------------------------+-----------+

match p = (n where @id = 1)-[r]->{1,2}(m) RETURN p, r.p_string order by p;
+--------------------------------------------------------------------+-----------------+
|                                                                  p |      r.p_string |
+--------------------------------------------------------------------+-----------------+
|                              (1:node1)-[:edge_n1_n2|0]->(10:node2) |         [1->10] |
|                              (1:node1)-[:edge_n1_n2|0]->(11:node2) |         [1->11] |
|                              (1:node1)-[:edge_n1_n2|0]->(12:node2) |         [1->12] |
| (1:node1)-[:edge_n1_n2|0]->(10:node2)-[:edge_n2_n3|0]->(100:node3) | [1->10,10->100] |
| (1:node1)-[:edge_n1_n2|0]->(10:node2)-[:edge_n2_n3|0]->(101:node3) | [1->10,10->101] |
| (1:node1)-[:edge_n1_n2|0]->(10:node2)-[:edge_n2_n3|0]->(102:node3) | [1->10,10->102] |
| (1:node1)-[:edge_n1_n2|0]->(11:node2)-[:edge_n2_n3|0]->(110:node3) | [1->11,11->110] |
| (1:node1)-[:edge_n1_n2|0]->(11:node2)-[:edge_n2_n3|0]->(111:node3) | [1->11,11->111] |
| (1:node1)-[:edge_n1_n2|0]->(11:node2)-[:edge_n2_n3|0]->(112:node3) | [1->11,11->112] |
| (1:node1)-[:edge_n1_n2|0]->(12:node2)-[:edge_n2_n3|0]->(120:node3) | [1->12,12->120] |
| (1:node1)-[:edge_n1_n2|0]->(12:node2)-[:edge_n2_n3|0]->(121:node3) | [1->12,12->121] |
| (1:node1)-[:edge_n1_n2|0]->(12:node2)-[:edge_n2_n3|0]->(122:node3) | [1->12,12->122] |
+--------------------------------------------------------------------+-----------------+

match p = (n where @id = 1)-[r]->{1,2}(m) RETURN p, r.p_string, m.p_long order by p;
+--------------------------------------------------------------------+-----------------+----------+
|                                                                  p |      r.p_string | m.p_long |
+--------------------------------------------------------------------+-----------------+----------+
|                              (1:node1)-[:edge_n1_n2|0]->(10:node2) |         [1->10] |       10 |
|                              (1:node1)-[:edge_n1_n2|0]->(11:node2) |         [1->11] |       11 |
|                              (1:node1)-[:edge_n1_n2|0]->(12:node2) |         [1->12] |       12 |
| (1:node1)-[:edge_n1_n2|0]->(10:node2)-[:edge_n2_n3|0]->(100:node3) | [1->10,10->100] |      100 |
| (1:node1)-[:edge_n1_n2|0]->(10:node2)-[:edge_n2_n3|0]->(101:node3) | [1->10,10->101] |      101 |
| (1:node1)-[:edge_n1_n2|0]->(10:node2)-[:edge_n2_n3|0]->(102:node3) | [1->10,10->102] |      102 |
| (1:node1)-[:edge_n1_n2|0]->(11:node2)-[:edge_n2_n3|0]->(110:node3) | [1->11,11->110] |      110 |
| (1:node1)-[:edge_n1_n2|0]->(11:node2)-[:edge_n2_n3|0]->(111:node3) | [1->11,11->111] |      111 |
| (1:node1)-[:edge_n1_n2|0]->(11:node2)-[:edge_n2_n3|0]->(112:node3) | [1->11,11->112] |      112 |
| (1:node1)-[:edge_n1_n2|0]->(12:node2)-[:edge_n2_n3|0]->(120:node3) | [1->12,12->120] |      120 |
| (1:node1)-[:edge_n1_n2|0]->(12:node2)-[:edge_n2_n3|0]->(121:node3) | [1->12,12->121] |      121 |
| (1:node1)-[:edge_n1_n2|0]->(12:node2)-[:edge_n2_n3|0]->(122:node3) | [1->12,12->122] |      122 |
+--------------------------------------------------------------------+-----------------+----------+

match p = (n where @id = 1)-[r]->{0,2}(m) RETURN p, r.p_string, m.p_long order by p;
+--------------------------------------------------------------------+-----------------+----------+
|                                                                  p |      r.p_string | m.p_long |
+--------------------------------------------------------------------+-----------------+----------+
|                                                          (1:node1) |              [] |        1 |
|                              (1:node1)-[:edge_n1_n2|0]->(10:node2) |         [1->10] |       10 |
|                              (1:node1)-[:edge_n1_n2|0]->(11:node2) |         [1->11] |       11 |
|                              (1:node1)-[:edge_n1_n2|0]->(12:node2) |         [1->12] |       12 |
| (1:node1)-[:edge_n1_n2|0]->(10:node2)-[:edge_n2_n3|0]->(100:node3) | [1->10,10->100] |      100 |
| (1:node1)-[:edge_n1_n2|0]->(10:node2)-[:edge_n2_n3|0]->(101:node3) | [1->10,10->101] |      101 |
| (1:node1)-[:edge_n1_n2|0]->(10:node2)-[:edge_n2_n3|0]->(102:node3) | [1->10,10->102] |      102 |
| (1:node1)-[:edge_n1_n2|0]->(11:node2)-[:edge_n2_n3|0]->(110:node3) | [1->11,11->110] |      110 |
| (1:node1)-[:edge_n1_n2|0]->(11:node2)-[:edge_n2_n3|0]->(111:node3) | [1->11,11->111] |      111 |
| (1:node1)-[:edge_n1_n2|0]->(11:node2)-[:edge_n2_n3|0]->(112:node3) | [1->11,11->112] |      112 |
| (1:node1)-[:edge_n1_n2|0]->(12:node2)-[:edge_n2_n3|0]->(120:node3) | [1->12,12->120] |      120 |
| (1:node1)-[:edge_n1_n2|0]->(12:node2)-[:edge_n2_n3|0]->(121:node3) | [1->12,12->121] |      121 |
| (1:node1)-[:edge_n1_n2|0]->(12:node2)-[:edge_n2_n3|0]->(122:node3) | [1->12,12->122] |      122 |
+--------------------------------------------------------------------+-----------------+----------+

match (n where @id = 1)-[r]->{1,2}(m) RETURN n.@id, m.@id order by n.@id, m.@id;
+-------+-------+
| n.@id | m.@id |
+-------+-------+
|     1 |    10 |
|     1 |    11 |
|     1 |    12 |
|     1 |   100 |
|     1 |   101 |
|     1 |   102 |
|     1 |   110 |
|     1 |   111 |
|     1 |   112 |
|     1 |   120 |
|     1 |   121 |
|     1 |   122 |
+-------+-------+

match (n where @id = 1)-[r]->{2,2}(m) RETURN n.@id, m.@id order by n.@id, m.@id;
+-------+-------+
| n.@id | m.@id |
+-------+-------+
|     1 |   100 |
|     1 |   101 |
|     1 |   102 |
|     1 |   110 |
|     1 |   111 |
|     1 |   112 |
|     1 |   120 |
|     1 |   121 |
|     1 |   122 |
+-------+-------+

match p = (n where @id = 10)-[r]-{1,2}(m) RETURN p order by p;
+---------------------------------------------------------------------+
|                                                                   p |
+---------------------------------------------------------------------+
|                               (10:node2)<-[:edge_n1_n2|0]-(1:node1) |
|                             (10:node2)-[:edge_n2_n3|0]->(100:node3) |
|                             (10:node2)-[:edge_n2_n3|0]->(101:node3) |
|                             (10:node2)-[:edge_n2_n3|0]->(102:node3) |
|   (10:node2)<-[:edge_n1_n2|0]-(1:node1)-[:edge_n1_n2|0]->(10:node2) |
|   (10:node2)<-[:edge_n1_n2|0]-(1:node1)-[:edge_n1_n2|0]->(11:node2) |
|   (10:node2)<-[:edge_n1_n2|0]-(1:node1)-[:edge_n1_n2|0]->(12:node2) |
| (10:node2)-[:edge_n2_n3|0]->(100:node3)<-[:edge_n2_n3|0]-(10:node2) |
| (10:node2)-[:edge_n2_n3|0]->(101:node3)<-[:edge_n2_n3|0]-(10:node2) |
| (10:node2)-[:edge_n2_n3|0]->(102:node3)<-[:edge_n2_n3|0]-(10:node2) |
+---------------------------------------------------------------------+

match p = (n1 where @id = 10)-[r1]-{1,1}(n2)-[r2]-{1,1}(n3) RETURN p order by p;
+---------------------------------------------------------------------+
|                                                                   p |
+---------------------------------------------------------------------+
|   (10:node2)<-[:edge_n1_n2|0]-(1:node1)-[:edge_n1_n2|0]->(10:node2) |
|   (10:node2)<-[:edge_n1_n2|0]-(1:node1)-[:edge_n1_n2|0]->(11:node2) |
|   (10:node2)<-[:edge_n1_n2|0]-(1:node1)-[:edge_n1_n2|0]->(12:node2) |
| (10:node2)-[:edge_n2_n3|0]->(100:node3)<-[:edge_n2_n3|0]-(10:node2) |
| (10:node2)-[:edge_n2_n3|0]->(101:node3)<-[:edge_n2_n3|0]-(10:node2) |
| (10:node2)-[:edge_n2_n3|0]->(102:node3)<-[:edge_n2_n3|0]-(10:node2) |
+---------------------------------------------------------------------+

match p = (n1 where @id = 10)-[r1]-{1,1}(n2)-[r2]-(n3) RETURN p order by p;
+---------------------------------------------------------------------+
|                                                                   p |
+---------------------------------------------------------------------+
|   (10:node2)<-[:edge_n1_n2|0]-(1:node1)-[:edge_n1_n2|0]->(10:node2) |
|   (10:node2)<-[:edge_n1_n2|0]-(1:node1)-[:edge_n1_n2|0]->(11:node2) |
|   (10:node2)<-[:edge_n1_n2|0]-(1:node1)-[:edge_n1_n2|0]->(12:node2) |
| (10:node2)-[:edge_n2_n3|0]->(100:node3)<-[:edge_n2_n3|0]-(10:node2) |
| (10:node2)-[:edge_n2_n3|0]->(101:node3)<-[:edge_n2_n3|0]-(10:node2) |
| (10:node2)-[:edge_n2_n3|0]->(102:node3)<-[:edge_n2_n3|0]-(10:node2) |
+---------------------------------------------------------------------+

match p = (n where @id = 1)-[r]->{1,2}(m where @id >= 100) RETURN p order by p;
+--------------------------------------------------------------------+
|                                                                  p |
+--------------------------------------------------------------------+
| (1:node1)-[:edge_n1_n2|0]->(10:node2)-[:edge_n2_n3|0]->(100:node3) |
| (1:node1)-[:edge_n1_n2|0]->(10:node2)-[:edge_n2_n3|0]->(101:node3) |
| (1:node1)-[:edge_n1_n2|0]->(10:node2)-[:edge_n2_n3|0]->(102:node3) |
| (1:node1)-[:edge_n1_n2|0]->(11:node2)-[:edge_n2_n3|0]->(110:node3) |
| (1:node1)-[:edge_n1_n2|0]->(11:node2)-[:edge_n2_n3|0]->(111:node3) |
| (1:node1)-[:edge_n1_n2|0]->(11:node2)-[:edge_n2_n3|0]->(112:node3) |
| (1:node1)-[:edge_n1_n2|0]->(12:node2)-[:edge_n2_n3|0]->(120:node3) |
| (1:node1)-[:edge_n1_n2|0]->(12:node2)-[:edge_n2_n3|0]->(121:node3) |
| (1:node1)-[:edge_n1_n2|0]->(12:node2)-[:edge_n2_n3|0]->(122:node3) |
+--------------------------------------------------------------------+

match p = (n where @id = 1)-[r]->{1,2}(m where @id >= 100) RETURN p, m.@id order by p;
+--------------------------------------------------------------------+-------+
|                                                                  p | m.@id |
+--------------------------------------------------------------------+-------+
| (1:node1)-[:edge_n1_n2|0]->(10:node2)-[:edge_n2_n3|0]->(100:node3) |   100 |
| (1:node1)-[:edge_n1_n2|0]->(10:node2)-[:edge_n2_n3|0]->(101:node3) |   101 |
| (1:node1)-[:edge_n1_n2|0]->(10:node2)-[:edge_n2_n3|0]->(102:node3) |   102 |
| (1:node1)-[:edge_n1_n2|0]->(11:node2)-[:edge_n2_n3|0]->(110:node3) |   110 |
| (1:node1)-[:edge_n1_n2|0]->(11:node2)-[:edge_n2_n3|0]->(111:node3) |   111 |
| (1:node1)-[:edge_n1_n2|0]->(11:node2)-[:edge_n2_n3|0]->(112:node3) |   112 |
| (1:node1)-[:edge_n1_n2|0]->(12:node2)-[:edge_n2_n3|0]->(120:node3) |   120 |
| (1:node1)-[:edge_n1_n2|0]->(12:node2)-[:edge_n2_n3|0]->(121:node3) |   121 |
| (1:node1)-[:edge_n1_n2|0]->(12:node2)-[:edge_n2_n3|0]->(122:node3) |   122 |
+--------------------------------------------------------------------+-------+

match p = (n where @id = 1)-[r]->{0,2}(m where @id >= 10) RETURN p order by p;
+--------------------------------------------------------------------+
|                                                                  p |
+--------------------------------------------------------------------+
|                              (1:node1)-[:edge_n1_n2|0]->(10:node2) |
|                              (1:node1)-[:edge_n1_n2|0]->(11:node2) |
|                              (1:node1)-[:edge_n1_n2|0]->(12:node2) |
| (1:node1)-[:edge_n1_n2|0]->(10:node2)-[:edge_n2_n3|0]->(100:node3) |
| (1:node1)-[:edge_n1_n2|0]->(10:node2)-[:edge_n2_n3|0]->(101:node3) |
| (1:node1)-[:edge_n1_n2|0]->(10:node2)-[:edge_n2_n3|0]->(102:node3) |
| (1:node1)-[:edge_n1_n2|0]->(11:node2)-[:edge_n2_n3|0]->(110:node3) |
| (1:node1)-[:edge_n1_n2|0]->(11:node2)-[:edge_n2_n3|0]->(111:node3) |
| (1:node1)-[:edge_n1_n2|0]->(11:node2)-[:edge_n2_n3|0]->(112:node3) |
| (1:node1)-[:edge_n1_n2|0]->(12:node2)-[:edge_n2_n3|0]->(120:node3) |
| (1:node1)-[:edge_n1_n2|0]->(12:node2)-[:edge_n2_n3|0]->(121:node3) |
| (1:node1)-[:edge_n1_n2|0]->(12:node2)-[:edge_n2_n3|0]->(122:node3) |
+--------------------------------------------------------------------+

match p = (n where @id = 1)-[r]->{0,2}(m where @id >= 10) RETURN p, m.@id order by p;
+--------------------------------------------------------------------+-------+
|                                                                  p | m.@id |
+--------------------------------------------------------------------+-------+
|                              (1:node1)-[:edge_n1_n2|0]->(10:node2) |    10 |
|                              (1:node1)-[:edge_n1_n2|0]->(11:node2) |    11 |
|                              (1:node1)-[:edge_n1_n2|0]->(12:node2) |    12 |
| (1:node1)-[:edge_n1_n2|0]->(10:node2)-[:edge_n2_n3|0]->(100:node3) |   100 |
| (1:node1)-[:edge_n1_n2|0]->(10:node2)-[:edge_n2_n3|0]->(101:node3) |   101 |
| (1:node1)-[:edge_n1_n2|0]->(10:node2)-[:edge_n2_n3|0]->(102:node3) |   102 |
| (1:node1)-[:edge_n1_n2|0]->(11:node2)-[:edge_n2_n3|0]->(110:node3) |   110 |
| (1:node1)-[:edge_n1_n2|0]->(11:node2)-[:edge_n2_n3|0]->(111:node3) |   111 |
| (1:node1)-[:edge_n1_n2|0]->(11:node2)-[:edge_n2_n3|0]->(112:node3) |   112 |
| (1:node1)-[:edge_n1_n2|0]->(12:node2)-[:edge_n2_n3|0]->(120:node3) |   120 |
| (1:node1)-[:edge_n1_n2|0]->(12:node2)-[:edge_n2_n3|0]->(121:node3) |   121 |
| (1:node1)-[:edge_n1_n2|0]->(12:node2)-[:edge_n2_n3|0]->(122:node3) |   122 |
+--------------------------------------------------------------------+-------+

match p = (n where @id = 1)-[r]->{1,2}(m) where m.@id >= 100 RETURN p order by p;
+--------------------------------------------------------------------+
|                                                                  p |
+--------------------------------------------------------------------+
| (1:node1)-[:edge_n1_n2|0]->(10:node2)-[:edge_n2_n3|0]->(100:node3) |
| (1:node1)-[:edge_n1_n2|0]->(10:node2)-[:edge_n2_n3|0]->(101:node3) |
| (1:node1)-[:edge_n1_n2|0]->(10:node2)-[:edge_n2_n3|0]->(102:node3) |
| (1:node1)-[:edge_n1_n2|0]->(11:node2)-[:edge_n2_n3|0]->(110:node3) |
| (1:node1)-[:edge_n1_n2|0]->(11:node2)-[:edge_n2_n3|0]->(111:node3) |
| (1:node1)-[:edge_n1_n2|0]->(11:node2)-[:edge_n2_n3|0]->(112:node3) |
| (1:node1)-[:edge_n1_n2|0]->(12:node2)-[:edge_n2_n3|0]->(120:node3) |
| (1:node1)-[:edge_n1_n2|0]->(12:node2)-[:edge_n2_n3|0]->(121:node3) |
| (1:node1)-[:edge_n1_n2|0]->(12:node2)-[:edge_n2_n3|0]->(122:node3) |
+--------------------------------------------------------------------+

match p = (n where @id = 1)-[r]->{0,2}(m) where m.@id >= 10 RETURN p order by p;
+--------------------------------------------------------------------+
|                                                                  p |
+--------------------------------------------------------------------+
|                              (1:node1)-[:edge_n1_n2|0]->(10:node2) |
|                              (1:node1)-[:edge_n1_n2|0]->(11:node2) |
|                              (1:node1)-[:edge_n1_n2|0]->(12:node2) |
| (1:node1)-[:edge_n1_n2|0]->(10:node2)-[:edge_n2_n3|0]->(100:node3) |
| (1:node1)-[:edge_n1_n2|0]->(10:node2)-[:edge_n2_n3|0]->(101:node3) |
| (1:node1)-[:edge_n1_n2|0]->(10:node2)-[:edge_n2_n3|0]->(102:node3) |
| (1:node1)-[:edge_n1_n2|0]->(11:node2)-[:edge_n2_n3|0]->(110:node3) |
| (1:node1)-[:edge_n1_n2|0]->(11:node2)-[:edge_n2_n3|0]->(111:node3) |
| (1:node1)-[:edge_n1_n2|0]->(11:node2)-[:edge_n2_n3|0]->(112:node3) |
| (1:node1)-[:edge_n1_n2|0]->(12:node2)-[:edge_n2_n3|0]->(120:node3) |
| (1:node1)-[:edge_n1_n2|0]->(12:node2)-[:edge_n2_n3|0]->(121:node3) |
| (1:node1)-[:edge_n1_n2|0]->(12:node2)-[:edge_n2_n3|0]->(122:node3) |
+--------------------------------------------------------------------+

MATCH p=(c where @id=1)-[r]-{,2}(a where @id = 1) RETURN p,a,c;
+------------------------------------------------------------------+-----------+-----------+
|                                                                p |         a |         c |
+------------------------------------------------------------------+-----------+-----------+
|                                                        (1:node1) | (1:node1) | (1:node1) |
| (1:node1)-[:edge_n1_n2|0]->(10:node2)<-[:edge_n1_n2|0]-(1:node1) | (1:node1) | (1:node1) |
| (1:node1)-[:edge_n1_n2|0]->(12:node2)<-[:edge_n1_n2|0]-(1:node1) | (1:node1) | (1:node1) |
| (1:node1)-[:edge_n1_n2|0]->(11:node2)<-[:edge_n1_n2|0]-(1:node1) | (1:node1) | (1:node1) |
+------------------------------------------------------------------+-----------+-----------+

MATCH (c where @id=1)-[r]-{,2}(a where @id = 1) RETURN a,c;
+-----------+-----------+
|         a |         c |
+-----------+-----------+
| (1:node1) | (1:node1) |
| (1:node1) | (1:node1) |
| (1:node1) | (1:node1) |
| (1:node1) | (1:node1) |
+-----------+-----------+

MATCH p = (a where @id=1)-[r]->{,2}(c where @id = 10) RETURN r.@timestamp,p;
+--------------+---------------------------------------+
| r.@timestamp |                                     p |
+--------------+---------------------------------------+
|          [0] | (1:node1)-[:edge_n1_n2|0]->(10:node2) |
+--------------+---------------------------------------+

MATCH p = (a where @id=1)-[r]->{,2}(c where @id = 10) RETURN r,p;
+-----------------------------+---------------------------------------+
|                           r |                                     p |
+-----------------------------+---------------------------------------+
| [(1)-[:edge_n1_n2|0]->(10)] | (1:node1)-[:edge_n1_n2|0]->(10:node2) |
+-----------------------------+---------------------------------------+

MATCH (a where @id=1)-[r]->{,2}(c where @id = 10) RETURN r.@timestamp;
+--------------+
| r.@timestamp |
+--------------+
|          [0] |
+--------------+

MATCH p = (n where @id = 1)-[r]->?(m) RETURN p order by p;
+---------------------------------------+
|                                     p |
+---------------------------------------+
|                             (1:node1) |
| (1:node1)-[:edge_n1_n2|0]->(10:node2) |
| (1:node1)-[:edge_n1_n2|0]->(11:node2) |
| (1:node1)-[:edge_n1_n2|0]->(12:node2) |
+---------------------------------------+

--error 2100
match p = (n where @id = 1)-[r]->{1,2}(m) RETURN p, length(n) order by p;

INSERT ()-[:edge_n1_n2{p_long:111, p_double:11.1, p_string:"1->10|1", @src_id:1, @dst_id:10, @timestamp:1}]->();

match p = (n:node1 where @id=1)-[r]->{0,2}(m) return p;
+--------------------------------------------------------------------+
|                                                                  p |
+--------------------------------------------------------------------+
|                                                          (1:node1) |
|                              (1:node1)-[:edge_n1_n2|0]->(10:node2) |
|                              (1:node1)-[:edge_n1_n2|0]->(11:node2) |
|                              (1:node1)-[:edge_n1_n2|0]->(12:node2) |
|                              (1:node1)-[:edge_n1_n2|1]->(10:node2) |
| (1:node1)-[:edge_n1_n2|0]->(10:node2)-[:edge_n2_n3|0]->(100:node3) |
| (1:node1)-[:edge_n1_n2|1]->(10:node2)-[:edge_n2_n3|0]->(100:node3) |
| (1:node1)-[:edge_n1_n2|0]->(10:node2)-[:edge_n2_n3|0]->(101:node3) |
| (1:node1)-[:edge_n1_n2|1]->(10:node2)-[:edge_n2_n3|0]->(101:node3) |
| (1:node1)-[:edge_n1_n2|0]->(10:node2)-[:edge_n2_n3|0]->(102:node3) |
| (1:node1)-[:edge_n1_n2|1]->(10:node2)-[:edge_n2_n3|0]->(102:node3) |
| (1:node1)-[:edge_n1_n2|0]->(12:node2)-[:edge_n2_n3|0]->(120:node3) |
| (1:node1)-[:edge_n1_n2|0]->(12:node2)-[:edge_n2_n3|0]->(121:node3) |
| (1:node1)-[:edge_n1_n2|0]->(12:node2)-[:edge_n2_n3|0]->(122:node3) |
| (1:node1)-[:edge_n1_n2|0]->(11:node2)-[:edge_n2_n3|0]->(110:node3) |
| (1:node1)-[:edge_n1_n2|0]->(11:node2)-[:edge_n2_n3|0]->(111:node3) |
| (1:node1)-[:edge_n1_n2|0]->(11:node2)-[:edge_n2_n3|0]->(112:node3) |
+--------------------------------------------------------------------+

match (n where @id = 1)-[r]->{1, 10}(m)
return count(distinct m)

+-------------------+
| count(distinct m) |
+-------------------+
|                12 |
+-------------------+

DELETE r MATCH ()-[r:edge_n1_n2{@src_id:1, @dst_id:10, @timestamp:1}]->();
