MATCH (n1:node1{@id:1}) return n1;
+-----------+
|        n1 |
+-----------+
| (1:node1) |
+-----------+

MATCH (n2:node2{@id:10}) return n2;
+------------+
|         n2 |
+------------+
| (10:node2) |
+------------+

MATCH (n1:node1{@id:1}) MATCH (n2:node2{@id:10}) return n1, n2;
+-----------+------------+
|        n1 |         n2 |
+-----------+------------+
| (1:node1) | (10:node2) |
+-----------+------------+

MATCH (a:node1 where @id = 1)-[b]->(c) RETURN a, b, c;
+-----------+---------------------------+------------+
|         a |                         b |          c |
+-----------+---------------------------+------------+
| (1:node1) | (1)-[:edge_n1_n2|0]->(10) | (10:node2) |
| (1:node1) | (1)-[:edge_n1_n2|0]->(11) | (11:node2) |
| (1:node1) | (1)-[:edge_n1_n2|0]->(12) | (12:node2) |
+-----------+---------------------------+------------+

MATCH (d:node2 where @id = 10)-[e]->(f) RETURN d, e, f;
+------------+-----------------------------+-------------+
|          d |                           e |           f |
+------------+-----------------------------+-------------+
| (10:node2) | (10)-[:edge_n2_n3|0]->(100) | (100:node3) |
| (10:node2) | (10)-[:edge_n2_n3|0]->(101) | (101:node3) |
| (10:node2) | (10)-[:edge_n2_n3|0]->(102) | (102:node3) |
+------------+-----------------------------+-------------+

MATCH (a:node1 where @id = 1)-[b]->(c) MATCH (d:node2 where @id = 10)-[e]->(f) RETURN a, b, c, d, e, f;
+-----------+---------------------------+------------+------------+-----------------------------+-------------+
|         a |                         b |          c |          d |                           e |           f |
+-----------+---------------------------+------------+------------+-----------------------------+-------------+
| (1:node1) | (1)-[:edge_n1_n2|0]->(10) | (10:node2) | (10:node2) | (10)-[:edge_n2_n3|0]->(100) | (100:node3) |
| (1:node1) | (1)-[:edge_n1_n2|0]->(10) | (10:node2) | (10:node2) | (10)-[:edge_n2_n3|0]->(101) | (101:node3) |
| (1:node1) | (1)-[:edge_n1_n2|0]->(10) | (10:node2) | (10:node2) | (10)-[:edge_n2_n3|0]->(102) | (102:node3) |
| (1:node1) | (1)-[:edge_n1_n2|0]->(11) | (11:node2) | (10:node2) | (10)-[:edge_n2_n3|0]->(100) | (100:node3) |
| (1:node1) | (1)-[:edge_n1_n2|0]->(11) | (11:node2) | (10:node2) | (10)-[:edge_n2_n3|0]->(101) | (101:node3) |
| (1:node1) | (1)-[:edge_n1_n2|0]->(11) | (11:node2) | (10:node2) | (10)-[:edge_n2_n3|0]->(102) | (102:node3) |
| (1:node1) | (1)-[:edge_n1_n2|0]->(12) | (12:node2) | (10:node2) | (10)-[:edge_n2_n3|0]->(100) | (100:node3) |
| (1:node1) | (1)-[:edge_n1_n2|0]->(12) | (12:node2) | (10:node2) | (10)-[:edge_n2_n3|0]->(101) | (101:node3) |
| (1:node1) | (1)-[:edge_n1_n2|0]->(12) | (12:node2) | (10:node2) | (10)-[:edge_n2_n3|0]->(102) | (102:node3) |
+-----------+---------------------------+------------+------------+-----------------------------+-------------+
